rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
/* Based on CPU DB MC9S08MM128_81, version 3.00.011 (RegistersPrg V2.32) */
/*
** ###################################################################
**     Filename  : mc9s08mm128.h
**     Processor : MC9S08MM128VMB
**     FileFormat: V2.32
**     DataSheet : MC9S08MM128RM Rev. 3 07/2010
**     Compiler  : CodeWarrior compiler
**     Date/Time : 5.10.2010, 13:53
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     Copyright : 1997 - 2010 Freescale Semiconductor, Inc. All Rights Reserved.
**     
**     http      : www.freescale.com
**     mail      : support@freescale.com
**
**     CPU Registers Revisions:
**      - 25.6.2010, V3.00.0:
**              - Removed SOPT5 register from 0x180D. This location is reserved for internal testing.
**
**     File-Format-Revisions:
**      - 18.05.2010, V2.32 :
**               - MISRA compliance: U/UL suffixes added to all numbers (_MASK,_BITNUM and addresses)
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S08MM128_H
#define _MC9S08MM128_H

/*lint -save  -e950 -esym(960,18.4) -e46 -esym(961,19.7) Disable MISRA rule (1.1,18.4,6.4,19.7) checking. */
/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

/* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(SRS = 0x55U, SRS = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */

/**************** interrupt vector numbers ****************/
#define VectorNumber_Vsci2tx            48U
#define VectorNumber_VReserved47        47U
#define VectorNumber_VReserved46        46U
#define VectorNumber_VReserved45        45U
#define VectorNumber_VReserved44        44U
#define VectorNumber_VReserved43        43U
#define VectorNumber_VReserved42        42U
#define VectorNumber_VReserved41        41U
#define VectorNumber_VReserved40        40U
#define VectorNumber_VReserved39        39U
#define VectorNumber_VReserved38        38U
#define VectorNumber_VReserved37        37U
#define VectorNumber_VReserved36        36U
#define VectorNumber_VReserved35        35U
#define VectorNumber_VReserved34        34U
#define VectorNumber_VReserved33        33U
#define VectorNumber_VReserved32        32U
#define VectorNumber_Vsci2rx            31U
#define VectorNumber_Vsci2err           30U
#define VectorNumber_Vtod               29U
#define VectorNumber_Vkeyboard2         28U
#define VectorNumber_Vkeyboard1         27U
#define VectorNumber_Vpracmp            26U
#define VectorNumber_Vadc               25U
#define VectorNumber_Viic               24U
#define VectorNumber_Vsci1tx            23U
#define VectorNumber_Vsci1rx            22U
#define VectorNumber_Vsci1err           21U
#define VectorNumber_Vcmt               20U
#define VectorNumber_Vspi2              19U
#define VectorNumber_Vtpm2ovf           18U
#define VectorNumber_Vtpm2ch3           17U
#define VectorNumber_Vtpm2ch2           16U
#define VectorNumber_Vtpm2ch1           15U
#define VectorNumber_Vtpm2ch0           14U
#define VectorNumber_Vtpm1ovf           13U
#define VectorNumber_Vtpm1ch3           12U
#define VectorNumber_Vtpm1ch2           11U
#define VectorNumber_Vtpm1ch1           10U
#define VectorNumber_Vtpm1ch0           9U
#define VectorNumber_Vdac               8U
#define VectorNumber_Vpdb               7U
#define VectorNumber_Vusb               6U
#define VectorNumber_Vspi1              5U
#define VectorNumber_Vlol               4U
#define VectorNumber_Vlvd               3U
#define VectorNumber_Virq               2U
#define VectorNumber_Vswi               1U
#define VectorNumber_Vreset             0U

/**************** interrupt vector table ****************/
#define Vsci2tx                         0xFF9EU
#define VReserved47                     0xFFA0U
#define VReserved46                     0xFFA2U
#define VReserved45                     0xFFA4U
#define VReserved44                     0xFFA6U
#define VReserved43                     0xFFA8U
#define VReserved42                     0xFFAAU
#define VReserved41                     0xFFACU
#define VReserved40                     0xFFAEU
#define VReserved39                     0xFFB0U
#define VReserved38                     0xFFB2U
#define VReserved37                     0xFFB4U
#define VReserved36                     0xFFB6U
#define VReserved35                     0xFFB8U
#define VReserved34                     0xFFBAU
#define VReserved33                     0xFFBCU
#define VReserved32                     0xFFBEU
#define Vsci2rx                         0xFFC0U
#define Vsci2err                        0xFFC2U
#define Vtod                            0xFFC4U
#define Vkeyboard2                      0xFFC6U
#define Vkeyboard1                      0xFFC8U
#define Vpracmp                         0xFFCAU
#define Vadc                            0xFFCCU
#define Viic                            0xFFCEU
#define Vsci1tx                         0xFFD0U
#define Vsci1rx                         0xFFD2U
#define Vsci1err                        0xFFD4U
#define Vcmt                            0xFFD6U
#define Vspi2                           0xFFD8U
#define Vtpm2ovf                        0xFFDAU
#define Vtpm2ch3                        0xFFDCU
#define Vtpm2ch2                        0xFFDEU
#define Vtpm2ch1                        0xFFE0U
#define Vtpm2ch0                        0xFFE2U
#define Vtpm1ovf                        0xFFE4U
#define Vtpm1ch3                        0xFFE6U
#define Vtpm1ch2                        0xFFE8U
#define Vtpm1ch1                        0xFFEAU
#define Vtpm1ch0                        0xFFECU
#define Vdac                            0xFFEEU
#define Vpdb                            0xFFF0U
#define Vusb                            0xFFF2U
#define Vspi1                           0xFFF4U
#define Vlol                            0xFFF6U
#define Vlvd                            0xFFF8U
#define Virq                            0xFFFAU
#define Vswi                            0xFFFCU
#define Vreset                          0xFFFEU

/**************** registers I/O map ****************/

/*** PTAD - Port A Data Register; 0x00000000 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAD0       :1;                                       /* Port A Data Register Bit 0 */
    byte PTAD1       :1;                                       /* Port A Data Register Bit 1 */
    byte PTAD2       :1;                                       /* Port A Data Register Bit 2 */
    byte PTAD3       :1;                                       /* Port A Data Register Bit 3 */
    byte PTAD4       :1;                                       /* Port A Data Register Bit 4 */
    byte PTAD5       :1;                                       /* Port A Data Register Bit 5 */
    byte PTAD6       :1;                                       /* Port A Data Register Bit 6 */
    byte PTAD7       :1;                                       /* Port A Data Register Bit 7 */
  } Bits;
} PTADSTR;
extern volatile PTADSTR _PTAD @0x00000000;
#define PTAD                            _PTAD.Byte
#define PTAD_PTAD0                      _PTAD.Bits.PTAD0
#define PTAD_PTAD1                      _PTAD.Bits.PTAD1
#define PTAD_PTAD2                      _PTAD.Bits.PTAD2
#define PTAD_PTAD3                      _PTAD.Bits.PTAD3
#define PTAD_PTAD4                      _PTAD.Bits.PTAD4
#define PTAD_PTAD5                      _PTAD.Bits.PTAD5
#define PTAD_PTAD6                      _PTAD.Bits.PTAD6
#define PTAD_PTAD7                      _PTAD.Bits.PTAD7

#define PTAD_PTAD0_MASK                 1U
#define PTAD_PTAD1_MASK                 2U
#define PTAD_PTAD2_MASK                 4U
#define PTAD_PTAD3_MASK                 8U
#define PTAD_PTAD4_MASK                 16U
#define PTAD_PTAD5_MASK                 32U
#define PTAD_PTAD6_MASK                 64U
#define PTAD_PTAD7_MASK                 128U


