rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
extern volatile ADCSC1CSTR _ADCSC1C @0x00000042;
#define ADCSC1C                         _ADCSC1C.Byte
#define ADCSC1C_ADCHC0                  _ADCSC1C.Bits.ADCHC0
#define ADCSC1C_ADCHC1                  _ADCSC1C.Bits.ADCHC1
#define ADCSC1C_ADCHC2                  _ADCSC1C.Bits.ADCHC2
#define ADCSC1C_ADCHC3                  _ADCSC1C.Bits.ADCHC3
#define ADCSC1C_ADCHC4                  _ADCSC1C.Bits.ADCHC4
#define ADCSC1C_DIFFC                   _ADCSC1C.Bits.DIFFC
#define ADCSC1C_AIENC                   _ADCSC1C.Bits.AIENC
#define ADCSC1C_COCOC                   _ADCSC1C.Bits.COCOC
#define ADCSC1C_ADCHC                   _ADCSC1C.MergedBits.grpADCHC

#define ADCSC1C_ADCHC0_MASK             1U
#define ADCSC1C_ADCHC1_MASK             2U
#define ADCSC1C_ADCHC2_MASK             4U
#define ADCSC1C_ADCHC3_MASK             8U
#define ADCSC1C_ADCHC4_MASK             16U
#define ADCSC1C_DIFFC_MASK              32U
#define ADCSC1C_AIENC_MASK              64U
#define ADCSC1C_COCOC_MASK              128U
#define ADCSC1C_ADCHC_MASK              31U
#define ADCSC1C_ADCHC_BITNUM            0U


/*** ADCSC1D - Status and Control Register 1D; 0x00000043 ***/
typedef union {
  byte Byte;
  struct {
    byte ADCHD0      :1;                                       /* Input Channel Select Bit 0 */
    byte ADCHD1      :1;                                       /* Input Channel Select Bit 1 */
    byte ADCHD2      :1;                                       /* Input Channel Select Bit 2 */
    byte ADCHD3      :1;                                       /* Input Channel Select Bit 3 */
    byte ADCHD4      :1;                                       /* Input Channel Select Bit 4 */
    byte DIFFD       :1;                                       /* Differential Mode Enable - DIFFD configures the ADC to operate in differential mode */
    byte AIEND       :1;                                       /* Interrupt Enable - AIEND enables conversion complete interrupts. When COCOD becomes set while the respective AIEND is high, an interrupt is asserted */
    byte COCOD       :1;                                       /* Conversion Complete Flag */
  } Bits;
  struct {
    byte grpADCHD :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ADCSC1DSTR;
extern volatile ADCSC1DSTR _ADCSC1D @0x00000043;
#define ADCSC1D                         _ADCSC1D.Byte
#define ADCSC1D_ADCHD0                  _ADCSC1D.Bits.ADCHD0
#define ADCSC1D_ADCHD1                  _ADCSC1D.Bits.ADCHD1
#define ADCSC1D_ADCHD2                  _ADCSC1D.Bits.ADCHD2
#define ADCSC1D_ADCHD3                  _ADCSC1D.Bits.ADCHD3
#define ADCSC1D_ADCHD4                  _ADCSC1D.Bits.ADCHD4
#define ADCSC1D_DIFFD                   _ADCSC1D.Bits.DIFFD
#define ADCSC1D_AIEND                   _ADCSC1D.Bits.AIEND
#define ADCSC1D_COCOD                   _ADCSC1D.Bits.COCOD
#define ADCSC1D_ADCHD                   _ADCSC1D.MergedBits.grpADCHD

#define ADCSC1D_ADCHD0_MASK             1U
#define ADCSC1D_ADCHD1_MASK             2U
#define ADCSC1D_ADCHD2_MASK             4U
#define ADCSC1D_ADCHD3_MASK             8U
#define ADCSC1D_ADCHD4_MASK             16U
#define ADCSC1D_DIFFD_MASK              32U
#define ADCSC1D_AIEND_MASK              64U
#define ADCSC1D_COCOD_MASK              128U
#define ADCSC1D_ADCHD_MASK              31U
#define ADCSC1D_ADCHD_BITNUM            0U


/*** ADCSC1E - Status and Control Register 1E; 0x00000044 ***/
typedef union {
  byte Byte;
  struct {
    byte ADCHE0      :1;                                       /* Input Channel Select Bit 0 */
    byte ADCHE1      :1;                                       /* Input Channel Select Bit 1 */
    byte ADCHE2      :1;                                       /* Input Channel Select Bit 2 */
    byte ADCHE3      :1;                                       /* Input Channel Select Bit 3 */
    byte ADCHE4      :1;                                       /* Input Channel Select Bit 4 */
    byte DIFFE       :1;                                       /* Differential Mode Enable - DIFFE configures the ADC to operate in differential mode */
    byte AIENE       :1;                                       /* Interrupt Enable - AIENE enables conversion complete interrupts. When COCOE becomes set while the respective AIENE is high, an interrupt is asserted */
    byte COCOE       :1;                                       /* Conversion Complete Flag */
  } Bits;
  struct {
    byte grpADCHE :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ADCSC1ESTR;
extern volatile ADCSC1ESTR _ADCSC1E @0x00000044;
#define ADCSC1E                         _ADCSC1E.Byte
#define ADCSC1E_ADCHE0                  _ADCSC1E.Bits.ADCHE0
#define ADCSC1E_ADCHE1                  _ADCSC1E.Bits.ADCHE1
#define ADCSC1E_ADCHE2                  _ADCSC1E.Bits.ADCHE2
#define ADCSC1E_ADCHE3                  _ADCSC1E.Bits.ADCHE3
#define ADCSC1E_ADCHE4                  _ADCSC1E.Bits.ADCHE4
#define ADCSC1E_DIFFE                   _ADCSC1E.Bits.DIFFE
#define ADCSC1E_AIENE                   _ADCSC1E.Bits.AIENE
#define ADCSC1E_COCOE                   _ADCSC1E.Bits.COCOE
#define ADCSC1E_ADCHE                   _ADCSC1E.MergedBits.grpADCHE

#define ADCSC1E_ADCHE0_MASK             1U
#define ADCSC1E_ADCHE1_MASK             2U
#define ADCSC1E_ADCHE2_MASK             4U
#define ADCSC1E_ADCHE3_MASK             8U
#define ADCSC1E_ADCHE4_MASK             16U
#define ADCSC1E_DIFFE_MASK              32U
#define ADCSC1E_AIENE_MASK              64U
#define ADCSC1E_COCOE_MASK              128U
#define ADCSC1E_ADCHE_MASK              31U
#define ADCSC1E_ADCHE_BITNUM            0U


/*** ADCSC1F - Status and Control Register 1F; 0x00000045 ***/
typedef union {
  byte Byte;
  struct {
    byte ADCHF0      :1;                                       /* Input Channel Select Bit 0 */
    byte ADCHF1      :1;                                       /* Input Channel Select Bit 1 */
    byte ADCHF2      :1;                                       /* Input Channel Select Bit 2 */
    byte ADCHF3      :1;                                       /* Input Channel Select Bit 3 */
    byte ADCHF4      :1;                                       /* Input Channel Select Bit 4 */
    byte DIFFF       :1;                                       /* Differential Mode Enable - DIFFF configures the ADC to operate in differential mode */
    byte AIENF       :1;                                       /* Interrupt Enable - AIENF enables conversion complete interrupts. When COCOF becomes set while the respective AIENF is high, an interrupt is asserted */
    byte COCOF       :1;                                       /* Conversion Complete Flag */
  } Bits;
  struct {
    byte grpADCHF :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ADCSC1FSTR;
extern volatile ADCSC1FSTR _ADCSC1F @0x00000045;
#define ADCSC1F                         _ADCSC1F.Byte
#define ADCSC1F_ADCHF0                  _ADCSC1F.Bits.ADCHF0
#define ADCSC1F_ADCHF1                  _ADCSC1F.Bits.ADCHF1
#define ADCSC1F_ADCHF2                  _ADCSC1F.Bits.ADCHF2
#define ADCSC1F_ADCHF3                  _ADCSC1F.Bits.ADCHF3
#define ADCSC1F_ADCHF4                  _ADCSC1F.Bits.ADCHF4
#define ADCSC1F_DIFFF                   _ADCSC1F.Bits.DIFFF
#define ADCSC1F_AIENF                   _ADCSC1F.Bits.AIENF
#define ADCSC1F_COCOF                   _ADCSC1F.Bits.COCOF
#define ADCSC1F_ADCHF                   _ADCSC1F.MergedBits.grpADCHF

#define ADCSC1F_ADCHF0_MASK             1U
#define ADCSC1F_ADCHF1_MASK             2U
#define ADCSC1F_ADCHF2_MASK             4U
#define ADCSC1F_ADCHF3_MASK             8U
#define ADCSC1F_ADCHF4_MASK             16U
#define ADCSC1F_DIFFF_MASK              32U
#define ADCSC1F_AIENF_MASK              64U
#define ADCSC1F_COCOF_MASK              128U
#define ADCSC1F_ADCHF_MASK              31U
#define ADCSC1F_ADCHF_BITNUM            0U


/*** ADCSC1G - Status and Control Register 1G; 0x00000046 ***/
typedef union {
  byte Byte;
  struct {
    byte ADCHG0      :1;                                       /* Input Channel Select Bit 0 */
    byte ADCHG1      :1;                                       /* Input Channel Select Bit 1 */
    byte ADCHG2      :1;                                       /* Input Channel Select Bit 2 */
    byte ADCHG3      :1;                                       /* Input Channel Select Bit 3 */
    byte ADCHG4      :1;                                       /* Input Channel Select Bit 4 */
    byte DIFFG       :1;                                       /* Differential Mode Enable - DIFFG configures the ADC to operate in differential mode */
    byte AIENG       :1;                                       /* Interrupt Enable - AIENG enables conversion complete interrupts. When COCOG becomes set while the respective AIENG is high, an interrupt is asserted */
    byte COCOG       :1;                                       /* Conversion Complete Flag */
  } Bits;
  struct {
    byte grpADCHG :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ADCSC1GSTR;
extern volatile ADCSC1GSTR _ADCSC1G @0x00000046;
#define ADCSC1G                         _ADCSC1G.Byte
#define ADCSC1G_ADCHG0                  _ADCSC1G.Bits.ADCHG0
#define ADCSC1G_ADCHG1                  _ADCSC1G.Bits.ADCHG1
#define ADCSC1G_ADCHG2                  _ADCSC1G.Bits.ADCHG2
#define ADCSC1G_ADCHG3                  _ADCSC1G.Bits.ADCHG3
#define ADCSC1G_ADCHG4                  _ADCSC1G.Bits.ADCHG4
#define ADCSC1G_DIFFG                   _ADCSC1G.Bits.DIFFG
#define ADCSC1G_AIENG                   _ADCSC1G.Bits.AIENG
#define ADCSC1G_COCOG                   _ADCSC1G.Bits.COCOG
#define ADCSC1G_ADCHG                   _ADCSC1G.MergedBits.grpADCHG

#define ADCSC1G_ADCHG0_MASK             1U
#define ADCSC1G_ADCHG1_MASK             2U
#define ADCSC1G_ADCHG2_MASK             4U
#define ADCSC1G_ADCHG3_MASK             8U
#define ADCSC1G_ADCHG4_MASK             16U
#define ADCSC1G_DIFFG_MASK              32U
#define ADCSC1G_AIENG_MASK              64U
#define ADCSC1G_COCOG_MASK              128U
#define ADCSC1G_ADCHG_MASK              31U
#define ADCSC1G_ADCHG_BITNUM            0U


/*** ADCSC1H - Status and Control Register 1H; 0x00000047 ***/
typedef union {
  byte Byte;
  struct {
    byte ADCHH0      :1;                                       /* Input Channel Select Bit 0 */
    byte ADCHH1      :1;                                       /* Input Channel Select Bit 1 */
    byte ADCHH2      :1;                                       /* Input Channel Select Bit 2 */
    byte ADCHH3      :1;                                       /* Input Channel Select Bit 3 */
    byte ADCHH4      :1;                                       /* Input Channel Select Bit 4 */
    byte DIFFH       :1;                                       /* Differential Mode Enable - DIFFH configures the ADC to operate in differential mode */
    byte AIENH       :1;                                       /* Interrupt Enable - AIENH enables conversion complete interrupts. When COCOH becomes set while the respective AIENH is high, an interrupt is asserted */
    byte COCOH       :1;                                       /* Conversion Complete Flag */
  } Bits;
  struct {
    byte grpADCHH :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} ADCSC1HSTR;
