rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
} ADCRASTR;
extern volatile ADCRASTR _ADCRA @0x0000004A;
#define ADCRA                           _ADCRA.Word


/*** ADCRB - Data Result Register B; 0x0000004C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCRHB - Data Result High Register B; 0x0000004C ***/
    union {
      byte Byte;
      struct {
        byte D8          :1;                                       /* ADC Result Data Bit 8 */
        byte D9          :1;                                       /* ADC Result Data Bit 9 */
        byte D10         :1;                                       /* ADC Result Data Bit 10 */
        byte D11         :1;                                       /* ADC Result Data Bit 11 */
        byte D12         :1;                                       /* ADC Result Data Bit 12 */
        byte D13         :1;                                       /* ADC Result Data Bit 13 */
        byte D14         :1;                                       /* ADC Result Data Bit 14 */
        byte D15         :1;                                       /* ADC Result Data Bit 15 */
      } Bits;
    } ADCRHBSTR;
    #define ADCRHB                      _ADCRB.Overlap_STR.ADCRHBSTR.Byte
    #define ADCRHB_D8                   _ADCRB.Overlap_STR.ADCRHBSTR.Bits.D8
    #define ADCRHB_D9                   _ADCRB.Overlap_STR.ADCRHBSTR.Bits.D9
    #define ADCRHB_D10                  _ADCRB.Overlap_STR.ADCRHBSTR.Bits.D10
    #define ADCRHB_D11                  _ADCRB.Overlap_STR.ADCRHBSTR.Bits.D11
    #define ADCRHB_D12                  _ADCRB.Overlap_STR.ADCRHBSTR.Bits.D12
    #define ADCRHB_D13                  _ADCRB.Overlap_STR.ADCRHBSTR.Bits.D13
    #define ADCRHB_D14                  _ADCRB.Overlap_STR.ADCRHBSTR.Bits.D14
    #define ADCRHB_D15                  _ADCRB.Overlap_STR.ADCRHBSTR.Bits.D15
    
    #define ADCRHB_D8_MASK              1U
    #define ADCRHB_D9_MASK              2U
    #define ADCRHB_D10_MASK             4U
    #define ADCRHB_D11_MASK             8U
    #define ADCRHB_D12_MASK             16U
    #define ADCRHB_D13_MASK             32U
    #define ADCRHB_D14_MASK             64U
    #define ADCRHB_D15_MASK             128U
    

    /*** ADCRLB - Data Result Low Register B; 0x0000004D ***/
    union {
      byte Byte;
      struct {
        byte D0          :1;                                       /* ADC Result Data Bit 0 */
        byte D1          :1;                                       /* ADC Result Data Bit 1 */
        byte D2          :1;                                       /* ADC Result Data Bit 2 */
        byte D3          :1;                                       /* ADC Result Data Bit 3 */
        byte D4          :1;                                       /* ADC Result Data Bit 4 */
        byte D5          :1;                                       /* ADC Result Data Bit 5 */
        byte D6          :1;                                       /* ADC Result Data Bit 6 */
        byte D7          :1;                                       /* ADC Result Data Bit 7 */
      } Bits;
    } ADCRLBSTR;
    #define ADCRLB                      _ADCRB.Overlap_STR.ADCRLBSTR.Byte
    #define ADCRLB_D0                   _ADCRB.Overlap_STR.ADCRLBSTR.Bits.D0
    #define ADCRLB_D1                   _ADCRB.Overlap_STR.ADCRLBSTR.Bits.D1
    #define ADCRLB_D2                   _ADCRB.Overlap_STR.ADCRLBSTR.Bits.D2
    #define ADCRLB_D3                   _ADCRB.Overlap_STR.ADCRLBSTR.Bits.D3
    #define ADCRLB_D4                   _ADCRB.Overlap_STR.ADCRLBSTR.Bits.D4
    #define ADCRLB_D5                   _ADCRB.Overlap_STR.ADCRLBSTR.Bits.D5
    #define ADCRLB_D6                   _ADCRB.Overlap_STR.ADCRLBSTR.Bits.D6
    #define ADCRLB_D7                   _ADCRB.Overlap_STR.ADCRLBSTR.Bits.D7
    
    #define ADCRLB_D0_MASK              1U
    #define ADCRLB_D1_MASK              2U
    #define ADCRLB_D2_MASK              4U
    #define ADCRLB_D3_MASK              8U
    #define ADCRLB_D4_MASK              16U
    #define ADCRLB_D5_MASK              32U
    #define ADCRLB_D6_MASK              64U
    #define ADCRLB_D7_MASK              128U
    
  } Overlap_STR;

} ADCRBSTR;
extern volatile ADCRBSTR _ADCRB @0x0000004C;
#define ADCRB                           _ADCRB.Word


/*** ADCRC - Data Result Register C; 0x0000004E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCRHC - Data Result High Register C; 0x0000004E ***/
    union {
      byte Byte;
      struct {
        byte D8          :1;                                       /* ADC Result Data Bit 8 */
        byte D9          :1;                                       /* ADC Result Data Bit 9 */
        byte D10         :1;                                       /* ADC Result Data Bit 10 */
        byte D11         :1;                                       /* ADC Result Data Bit 11 */
        byte D12         :1;                                       /* ADC Result Data Bit 12 */
        byte D13         :1;                                       /* ADC Result Data Bit 13 */
        byte D14         :1;                                       /* ADC Result Data Bit 14 */
        byte D15         :1;                                       /* ADC Result Data Bit 15 */
      } Bits;
    } ADCRHCSTR;
    #define ADCRHC                      _ADCRC.Overlap_STR.ADCRHCSTR.Byte
    #define ADCRHC_D8                   _ADCRC.Overlap_STR.ADCRHCSTR.Bits.D8
    #define ADCRHC_D9                   _ADCRC.Overlap_STR.ADCRHCSTR.Bits.D9
    #define ADCRHC_D10                  _ADCRC.Overlap_STR.ADCRHCSTR.Bits.D10
    #define ADCRHC_D11                  _ADCRC.Overlap_STR.ADCRHCSTR.Bits.D11
    #define ADCRHC_D12                  _ADCRC.Overlap_STR.ADCRHCSTR.Bits.D12
    #define ADCRHC_D13                  _ADCRC.Overlap_STR.ADCRHCSTR.Bits.D13
    #define ADCRHC_D14                  _ADCRC.Overlap_STR.ADCRHCSTR.Bits.D14
    #define ADCRHC_D15                  _ADCRC.Overlap_STR.ADCRHCSTR.Bits.D15
    
    #define ADCRHC_D8_MASK              1U
    #define ADCRHC_D9_MASK              2U
    #define ADCRHC_D10_MASK             4U
    #define ADCRHC_D11_MASK             8U
    #define ADCRHC_D12_MASK             16U
    #define ADCRHC_D13_MASK             32U
    #define ADCRHC_D14_MASK             64U
    #define ADCRHC_D15_MASK             128U
    

