rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
    /*** ADCRLC - Data Result Low Register C; 0x0000004F ***/
    union {
      byte Byte;
      struct {
        byte D0          :1;                                       /* ADC Result Data Bit 0 */
        byte D1          :1;                                       /* ADC Result Data Bit 1 */
        byte D2          :1;                                       /* ADC Result Data Bit 2 */
        byte D3          :1;                                       /* ADC Result Data Bit 3 */
        byte D4          :1;                                       /* ADC Result Data Bit 4 */
        byte D5          :1;                                       /* ADC Result Data Bit 5 */
        byte D6          :1;                                       /* ADC Result Data Bit 6 */
        byte D7          :1;                                       /* ADC Result Data Bit 7 */
      } Bits;
    } ADCRLCSTR;
    #define ADCRLC                      _ADCRC.Overlap_STR.ADCRLCSTR.Byte
    #define ADCRLC_D0                   _ADCRC.Overlap_STR.ADCRLCSTR.Bits.D0
    #define ADCRLC_D1                   _ADCRC.Overlap_STR.ADCRLCSTR.Bits.D1
    #define ADCRLC_D2                   _ADCRC.Overlap_STR.ADCRLCSTR.Bits.D2
    #define ADCRLC_D3                   _ADCRC.Overlap_STR.ADCRLCSTR.Bits.D3
    #define ADCRLC_D4                   _ADCRC.Overlap_STR.ADCRLCSTR.Bits.D4
    #define ADCRLC_D5                   _ADCRC.Overlap_STR.ADCRLCSTR.Bits.D5
    #define ADCRLC_D6                   _ADCRC.Overlap_STR.ADCRLCSTR.Bits.D6
    #define ADCRLC_D7                   _ADCRC.Overlap_STR.ADCRLCSTR.Bits.D7
    
    #define ADCRLC_D0_MASK              1U
    #define ADCRLC_D1_MASK              2U
    #define ADCRLC_D2_MASK              4U
    #define ADCRLC_D3_MASK              8U
    #define ADCRLC_D4_MASK              16U
    #define ADCRLC_D5_MASK              32U
    #define ADCRLC_D6_MASK              64U
    #define ADCRLC_D7_MASK              128U
    
  } Overlap_STR;

} ADCRCSTR;
extern volatile ADCRCSTR _ADCRC @0x0000004E;
#define ADCRC                           _ADCRC.Word


/*** ADCRD - Data Result Register D; 0x00000050 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCRHD - Data Result High Register D; 0x00000050 ***/
    union {
      byte Byte;
      struct {
        byte D8          :1;                                       /* ADC Result Data Bit 8 */
        byte D9          :1;                                       /* ADC Result Data Bit 9 */
        byte D10         :1;                                       /* ADC Result Data Bit 10 */
        byte D11         :1;                                       /* ADC Result Data Bit 11 */
        byte D12         :1;                                       /* ADC Result Data Bit 12 */
        byte D13         :1;                                       /* ADC Result Data Bit 13 */
        byte D14         :1;                                       /* ADC Result Data Bit 14 */
        byte D15         :1;                                       /* ADC Result Data Bit 15 */
      } Bits;
    } ADCRHDSTR;
    #define ADCRHD                      _ADCRD.Overlap_STR.ADCRHDSTR.Byte
    #define ADCRHD_D8                   _ADCRD.Overlap_STR.ADCRHDSTR.Bits.D8
    #define ADCRHD_D9                   _ADCRD.Overlap_STR.ADCRHDSTR.Bits.D9
    #define ADCRHD_D10                  _ADCRD.Overlap_STR.ADCRHDSTR.Bits.D10
    #define ADCRHD_D11                  _ADCRD.Overlap_STR.ADCRHDSTR.Bits.D11
    #define ADCRHD_D12                  _ADCRD.Overlap_STR.ADCRHDSTR.Bits.D12
    #define ADCRHD_D13                  _ADCRD.Overlap_STR.ADCRHDSTR.Bits.D13
    #define ADCRHD_D14                  _ADCRD.Overlap_STR.ADCRHDSTR.Bits.D14
    #define ADCRHD_D15                  _ADCRD.Overlap_STR.ADCRHDSTR.Bits.D15
    
    #define ADCRHD_D8_MASK              1U
    #define ADCRHD_D9_MASK              2U
    #define ADCRHD_D10_MASK             4U
    #define ADCRHD_D11_MASK             8U
    #define ADCRHD_D12_MASK             16U
    #define ADCRHD_D13_MASK             32U
    #define ADCRHD_D14_MASK             64U
    #define ADCRHD_D15_MASK             128U
    

    /*** ADCRLD - Data Result Low Register D; 0x00000051 ***/
    union {
      byte Byte;
      struct {
        byte D0          :1;                                       /* ADC Result Data Bit 0 */
        byte D1          :1;                                       /* ADC Result Data Bit 1 */
        byte D2          :1;                                       /* ADC Result Data Bit 2 */
        byte D3          :1;                                       /* ADC Result Data Bit 3 */
        byte D4          :1;                                       /* ADC Result Data Bit 4 */
        byte D5          :1;                                       /* ADC Result Data Bit 5 */
        byte D6          :1;                                       /* ADC Result Data Bit 6 */
        byte D7          :1;                                       /* ADC Result Data Bit 7 */
      } Bits;
    } ADCRLDSTR;
    #define ADCRLD                      _ADCRD.Overlap_STR.ADCRLDSTR.Byte
    #define ADCRLD_D0                   _ADCRD.Overlap_STR.ADCRLDSTR.Bits.D0
    #define ADCRLD_D1                   _ADCRD.Overlap_STR.ADCRLDSTR.Bits.D1
    #define ADCRLD_D2                   _ADCRD.Overlap_STR.ADCRLDSTR.Bits.D2
    #define ADCRLD_D3                   _ADCRD.Overlap_STR.ADCRLDSTR.Bits.D3
    #define ADCRLD_D4                   _ADCRD.Overlap_STR.ADCRLDSTR.Bits.D4
    #define ADCRLD_D5                   _ADCRD.Overlap_STR.ADCRLDSTR.Bits.D5
    #define ADCRLD_D6                   _ADCRD.Overlap_STR.ADCRLDSTR.Bits.D6
    #define ADCRLD_D7                   _ADCRD.Overlap_STR.ADCRLDSTR.Bits.D7
    
    #define ADCRLD_D0_MASK              1U
    #define ADCRLD_D1_MASK              2U
    #define ADCRLD_D2_MASK              4U
    #define ADCRLD_D3_MASK              8U
    #define ADCRLD_D4_MASK              16U
    #define ADCRLD_D5_MASK              32U
    #define ADCRLD_D6_MASK              64U
    #define ADCRLD_D7_MASK              128U
    
  } Overlap_STR;

