rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
} ADCRDSTR;
extern volatile ADCRDSTR _ADCRD @0x00000050;
#define ADCRD                           _ADCRD.Word


/*** ADCRE - Data Result Register E; 0x00000052 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCRHE - Data Result High Register E; 0x00000052 ***/
    union {
      byte Byte;
      struct {
        byte D8          :1;                                       /* ADC Result Data Bit 8 */
        byte D9          :1;                                       /* ADC Result Data Bit 9 */
        byte D10         :1;                                       /* ADC Result Data Bit 10 */
        byte D11         :1;                                       /* ADC Result Data Bit 11 */
        byte D12         :1;                                       /* ADC Result Data Bit 12 */
        byte D13         :1;                                       /* ADC Result Data Bit 13 */
        byte D14         :1;                                       /* ADC Result Data Bit 14 */
        byte D15         :1;                                       /* ADC Result Data Bit 15 */
      } Bits;
    } ADCRHESTR;
    #define ADCRHE                      _ADCRE.Overlap_STR.ADCRHESTR.Byte
    #define ADCRHE_D8                   _ADCRE.Overlap_STR.ADCRHESTR.Bits.D8
    #define ADCRHE_D9                   _ADCRE.Overlap_STR.ADCRHESTR.Bits.D9
    #define ADCRHE_D10                  _ADCRE.Overlap_STR.ADCRHESTR.Bits.D10
    #define ADCRHE_D11                  _ADCRE.Overlap_STR.ADCRHESTR.Bits.D11
    #define ADCRHE_D12                  _ADCRE.Overlap_STR.ADCRHESTR.Bits.D12
    #define ADCRHE_D13                  _ADCRE.Overlap_STR.ADCRHESTR.Bits.D13
    #define ADCRHE_D14                  _ADCRE.Overlap_STR.ADCRHESTR.Bits.D14
    #define ADCRHE_D15                  _ADCRE.Overlap_STR.ADCRHESTR.Bits.D15
    
    #define ADCRHE_D8_MASK              1U
    #define ADCRHE_D9_MASK              2U
    #define ADCRHE_D10_MASK             4U
    #define ADCRHE_D11_MASK             8U
    #define ADCRHE_D12_MASK             16U
    #define ADCRHE_D13_MASK             32U
    #define ADCRHE_D14_MASK             64U
    #define ADCRHE_D15_MASK             128U
    

    /*** ADCRLE - Data Result Low Register E; 0x00000053 ***/
    union {
      byte Byte;
      struct {
        byte D0          :1;                                       /* ADC Result Data Bit 0 */
        byte D1          :1;                                       /* ADC Result Data Bit 1 */
        byte D2          :1;                                       /* ADC Result Data Bit 2 */
        byte D3          :1;                                       /* ADC Result Data Bit 3 */
        byte D4          :1;                                       /* ADC Result Data Bit 4 */
        byte D5          :1;                                       /* ADC Result Data Bit 5 */
        byte D6          :1;                                       /* ADC Result Data Bit 6 */
        byte D7          :1;                                       /* ADC Result Data Bit 7 */
      } Bits;
    } ADCRLESTR;
    #define ADCRLE                      _ADCRE.Overlap_STR.ADCRLESTR.Byte
    #define ADCRLE_D0                   _ADCRE.Overlap_STR.ADCRLESTR.Bits.D0
    #define ADCRLE_D1                   _ADCRE.Overlap_STR.ADCRLESTR.Bits.D1
    #define ADCRLE_D2                   _ADCRE.Overlap_STR.ADCRLESTR.Bits.D2
    #define ADCRLE_D3                   _ADCRE.Overlap_STR.ADCRLESTR.Bits.D3
    #define ADCRLE_D4                   _ADCRE.Overlap_STR.ADCRLESTR.Bits.D4
    #define ADCRLE_D5                   _ADCRE.Overlap_STR.ADCRLESTR.Bits.D5
    #define ADCRLE_D6                   _ADCRE.Overlap_STR.ADCRLESTR.Bits.D6
    #define ADCRLE_D7                   _ADCRE.Overlap_STR.ADCRLESTR.Bits.D7
    
    #define ADCRLE_D0_MASK              1U
    #define ADCRLE_D1_MASK              2U
    #define ADCRLE_D2_MASK              4U
    #define ADCRLE_D3_MASK              8U
    #define ADCRLE_D4_MASK              16U
    #define ADCRLE_D5_MASK              32U
    #define ADCRLE_D6_MASK              64U
    #define ADCRLE_D7_MASK              128U
    
  } Overlap_STR;

} ADCRESTR;
extern volatile ADCRESTR _ADCRE @0x00000052;
#define ADCRE                           _ADCRE.Word


/*** ADCRF - Data Result Register F; 0x00000054 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCRHF - Data Result High Register F; 0x00000054 ***/
    union {
      byte Byte;
      struct {
        byte D8          :1;                                       /* ADC Result Data Bit 8 */
        byte D9          :1;                                       /* ADC Result Data Bit 9 */
        byte D10         :1;                                       /* ADC Result Data Bit 10 */
        byte D11         :1;                                       /* ADC Result Data Bit 11 */
        byte D12         :1;                                       /* ADC Result Data Bit 12 */
        byte D13         :1;                                       /* ADC Result Data Bit 13 */
        byte D14         :1;                                       /* ADC Result Data Bit 14 */
        byte D15         :1;                                       /* ADC Result Data Bit 15 */
      } Bits;
    } ADCRHFSTR;
    #define ADCRHF                      _ADCRF.Overlap_STR.ADCRHFSTR.Byte
    #define ADCRHF_D8                   _ADCRF.Overlap_STR.ADCRHFSTR.Bits.D8
    #define ADCRHF_D9                   _ADCRF.Overlap_STR.ADCRHFSTR.Bits.D9
    #define ADCRHF_D10                  _ADCRF.Overlap_STR.ADCRHFSTR.Bits.D10
    #define ADCRHF_D11                  _ADCRF.Overlap_STR.ADCRHFSTR.Bits.D11
    #define ADCRHF_D12                  _ADCRF.Overlap_STR.ADCRHFSTR.Bits.D12
    #define ADCRHF_D13                  _ADCRF.Overlap_STR.ADCRHFSTR.Bits.D13
    #define ADCRHF_D14                  _ADCRF.Overlap_STR.ADCRHFSTR.Bits.D14
    #define ADCRHF_D15                  _ADCRF.Overlap_STR.ADCRHFSTR.Bits.D15
    
    #define ADCRHF_D8_MASK              1U
    #define ADCRHF_D9_MASK              2U
    #define ADCRHF_D10_MASK             4U
    #define ADCRHF_D11_MASK             8U
    #define ADCRHF_D12_MASK             16U
    #define ADCRHF_D13_MASK             32U
    #define ADCRHF_D14_MASK             64U
    #define ADCRHF_D15_MASK             128U
    

