rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
    /*** ADCRLF - Data Result Low Register F; 0x00000055 ***/
    union {
      byte Byte;
      struct {
        byte D0          :1;                                       /* ADC Result Data Bit 0 */
        byte D1          :1;                                       /* ADC Result Data Bit 1 */
        byte D2          :1;                                       /* ADC Result Data Bit 2 */
        byte D3          :1;                                       /* ADC Result Data Bit 3 */
        byte D4          :1;                                       /* ADC Result Data Bit 4 */
        byte D5          :1;                                       /* ADC Result Data Bit 5 */
        byte D6          :1;                                       /* ADC Result Data Bit 6 */
        byte D7          :1;                                       /* ADC Result Data Bit 7 */
      } Bits;
    } ADCRLFSTR;
    #define ADCRLF                      _ADCRF.Overlap_STR.ADCRLFSTR.Byte
    #define ADCRLF_D0                   _ADCRF.Overlap_STR.ADCRLFSTR.Bits.D0
    #define ADCRLF_D1                   _ADCRF.Overlap_STR.ADCRLFSTR.Bits.D1
    #define ADCRLF_D2                   _ADCRF.Overlap_STR.ADCRLFSTR.Bits.D2
    #define ADCRLF_D3                   _ADCRF.Overlap_STR.ADCRLFSTR.Bits.D3
    #define ADCRLF_D4                   _ADCRF.Overlap_STR.ADCRLFSTR.Bits.D4
    #define ADCRLF_D5                   _ADCRF.Overlap_STR.ADCRLFSTR.Bits.D5
    #define ADCRLF_D6                   _ADCRF.Overlap_STR.ADCRLFSTR.Bits.D6
    #define ADCRLF_D7                   _ADCRF.Overlap_STR.ADCRLFSTR.Bits.D7
    
    #define ADCRLF_D0_MASK              1U
    #define ADCRLF_D1_MASK              2U
    #define ADCRLF_D2_MASK              4U
    #define ADCRLF_D3_MASK              8U
    #define ADCRLF_D4_MASK              16U
    #define ADCRLF_D5_MASK              32U
    #define ADCRLF_D6_MASK              64U
    #define ADCRLF_D7_MASK              128U
    
  } Overlap_STR;

} ADCRFSTR;
extern volatile ADCRFSTR _ADCRF @0x00000054;
#define ADCRF                           _ADCRF.Word


/*** ADCRG - Data Result Register G; 0x00000056 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCRHG - Data Result High Register G; 0x00000056 ***/
    union {
      byte Byte;
      struct {
        byte D8          :1;                                       /* ADC Result Data Bit 8 */
        byte D9          :1;                                       /* ADC Result Data Bit 9 */
        byte D10         :1;                                       /* ADC Result Data Bit 10 */
        byte D11         :1;                                       /* ADC Result Data Bit 11 */
        byte D12         :1;                                       /* ADC Result Data Bit 12 */
        byte D13         :1;                                       /* ADC Result Data Bit 13 */
        byte D14         :1;                                       /* ADC Result Data Bit 14 */
        byte D15         :1;                                       /* ADC Result Data Bit 15 */
      } Bits;
    } ADCRHGSTR;
    #define ADCRHG                      _ADCRG.Overlap_STR.ADCRHGSTR.Byte
    #define ADCRHG_D8                   _ADCRG.Overlap_STR.ADCRHGSTR.Bits.D8
    #define ADCRHG_D9                   _ADCRG.Overlap_STR.ADCRHGSTR.Bits.D9
    #define ADCRHG_D10                  _ADCRG.Overlap_STR.ADCRHGSTR.Bits.D10
    #define ADCRHG_D11                  _ADCRG.Overlap_STR.ADCRHGSTR.Bits.D11
    #define ADCRHG_D12                  _ADCRG.Overlap_STR.ADCRHGSTR.Bits.D12
    #define ADCRHG_D13                  _ADCRG.Overlap_STR.ADCRHGSTR.Bits.D13
    #define ADCRHG_D14                  _ADCRG.Overlap_STR.ADCRHGSTR.Bits.D14
    #define ADCRHG_D15                  _ADCRG.Overlap_STR.ADCRHGSTR.Bits.D15
    
    #define ADCRHG_D8_MASK              1U
    #define ADCRHG_D9_MASK              2U
    #define ADCRHG_D10_MASK             4U
    #define ADCRHG_D11_MASK             8U
    #define ADCRHG_D12_MASK             16U
    #define ADCRHG_D13_MASK             32U
    #define ADCRHG_D14_MASK             64U
    #define ADCRHG_D15_MASK             128U
    

    /*** ADCRLG - Data Result Low Register G; 0x00000057 ***/
    union {
      byte Byte;
      struct {
        byte D0          :1;                                       /* ADC Result Data Bit 0 */
        byte D1          :1;                                       /* ADC Result Data Bit 1 */
        byte D2          :1;                                       /* ADC Result Data Bit 2 */
        byte D3          :1;                                       /* ADC Result Data Bit 3 */
        byte D4          :1;                                       /* ADC Result Data Bit 4 */
        byte D5          :1;                                       /* ADC Result Data Bit 5 */
        byte D6          :1;                                       /* ADC Result Data Bit 6 */
        byte D7          :1;                                       /* ADC Result Data Bit 7 */
      } Bits;
    } ADCRLGSTR;
    #define ADCRLG                      _ADCRG.Overlap_STR.ADCRLGSTR.Byte
    #define ADCRLG_D0                   _ADCRG.Overlap_STR.ADCRLGSTR.Bits.D0
    #define ADCRLG_D1                   _ADCRG.Overlap_STR.ADCRLGSTR.Bits.D1
    #define ADCRLG_D2                   _ADCRG.Overlap_STR.ADCRLGSTR.Bits.D2
    #define ADCRLG_D3                   _ADCRG.Overlap_STR.ADCRLGSTR.Bits.D3
    #define ADCRLG_D4                   _ADCRG.Overlap_STR.ADCRLGSTR.Bits.D4
    #define ADCRLG_D5                   _ADCRG.Overlap_STR.ADCRLGSTR.Bits.D5
    #define ADCRLG_D6                   _ADCRG.Overlap_STR.ADCRLGSTR.Bits.D6
    #define ADCRLG_D7                   _ADCRG.Overlap_STR.ADCRLGSTR.Bits.D7
    
    #define ADCRLG_D0_MASK              1U
    #define ADCRLG_D1_MASK              2U
    #define ADCRLG_D2_MASK              4U
    #define ADCRLG_D3_MASK              8U
    #define ADCRLG_D4_MASK              16U
    #define ADCRLG_D5_MASK              32U
    #define ADCRLG_D6_MASK              64U
    #define ADCRLG_D7_MASK              128U
    
  } Overlap_STR;

