rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
} ADCRGSTR;
extern volatile ADCRGSTR _ADCRG @0x00000056;
#define ADCRG                           _ADCRG.Word


/*** ADCRH - Data Result Register H; 0x00000058 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** ADCRHH - Data Result High Register H; 0x00000058 ***/
    union {
      byte Byte;
      struct {
        byte D8          :1;                                       /* ADC Result Data Bit 8 */
        byte D9          :1;                                       /* ADC Result Data Bit 9 */
        byte D10         :1;                                       /* ADC Result Data Bit 10 */
        byte D11         :1;                                       /* ADC Result Data Bit 11 */
        byte D12         :1;                                       /* ADC Result Data Bit 12 */
        byte D13         :1;                                       /* ADC Result Data Bit 13 */
        byte D14         :1;                                       /* ADC Result Data Bit 14 */
        byte D15         :1;                                       /* ADC Result Data Bit 15 */
      } Bits;
    } ADCRHHSTR;
    #define ADCRHH                      _ADCRH.Overlap_STR.ADCRHHSTR.Byte
    #define ADCRHH_D8                   _ADCRH.Overlap_STR.ADCRHHSTR.Bits.D8
    #define ADCRHH_D9                   _ADCRH.Overlap_STR.ADCRHHSTR.Bits.D9
    #define ADCRHH_D10                  _ADCRH.Overlap_STR.ADCRHHSTR.Bits.D10
    #define ADCRHH_D11                  _ADCRH.Overlap_STR.ADCRHHSTR.Bits.D11
    #define ADCRHH_D12                  _ADCRH.Overlap_STR.ADCRHHSTR.Bits.D12
    #define ADCRHH_D13                  _ADCRH.Overlap_STR.ADCRHHSTR.Bits.D13
    #define ADCRHH_D14                  _ADCRH.Overlap_STR.ADCRHHSTR.Bits.D14
    #define ADCRHH_D15                  _ADCRH.Overlap_STR.ADCRHHSTR.Bits.D15
    
    #define ADCRHH_D8_MASK              1U
    #define ADCRHH_D9_MASK              2U
    #define ADCRHH_D10_MASK             4U
    #define ADCRHH_D11_MASK             8U
    #define ADCRHH_D12_MASK             16U
    #define ADCRHH_D13_MASK             32U
    #define ADCRHH_D14_MASK             64U
    #define ADCRHH_D15_MASK             128U
    

    /*** ADCRLH - Data Result Low Register H; 0x00000059 ***/
    union {
      byte Byte;
      struct {
        byte D0          :1;                                       /* ADC Result Data Bit 0 */
        byte D1          :1;                                       /* ADC Result Data Bit 1 */
        byte D2          :1;                                       /* ADC Result Data Bit 2 */
        byte D3          :1;                                       /* ADC Result Data Bit 3 */
        byte D4          :1;                                       /* ADC Result Data Bit 4 */
        byte D5          :1;                                       /* ADC Result Data Bit 5 */
        byte D6          :1;                                       /* ADC Result Data Bit 6 */
        byte D7          :1;                                       /* ADC Result Data Bit 7 */
      } Bits;
    } ADCRLHSTR;
    #define ADCRLH                      _ADCRH.Overlap_STR.ADCRLHSTR.Byte
    #define ADCRLH_D0                   _ADCRH.Overlap_STR.ADCRLHSTR.Bits.D0
    #define ADCRLH_D1                   _ADCRH.Overlap_STR.ADCRLHSTR.Bits.D1
    #define ADCRLH_D2                   _ADCRH.Overlap_STR.ADCRLHSTR.Bits.D2
    #define ADCRLH_D3                   _ADCRH.Overlap_STR.ADCRLHSTR.Bits.D3
    #define ADCRLH_D4                   _ADCRH.Overlap_STR.ADCRLHSTR.Bits.D4
    #define ADCRLH_D5                   _ADCRH.Overlap_STR.ADCRLHSTR.Bits.D5
    #define ADCRLH_D6                   _ADCRH.Overlap_STR.ADCRLHSTR.Bits.D6
    #define ADCRLH_D7                   _ADCRH.Overlap_STR.ADCRLHSTR.Bits.D7
    
    #define ADCRLH_D0_MASK              1U
    #define ADCRLH_D1_MASK              2U
    #define ADCRLH_D2_MASK              4U
    #define ADCRLH_D3_MASK              8U
    #define ADCRLH_D4_MASK              16U
    #define ADCRLH_D5_MASK              32U
    #define ADCRLH_D6_MASK              64U
    #define ADCRLH_D7_MASK              128U
    
  } Overlap_STR;

} ADCRHSTR;
extern volatile ADCRHSTR _ADCRH @0x00000058;
#define ADCRH                           _ADCRH.Word


/*** VREFTRM - VREF Trim Register; 0x0000005C ***/
typedef union {
  byte Byte;
  struct {
    byte TRM0        :1;                                       /* Trim Bits, bit 0 */
    byte TRM1        :1;                                       /* Trim Bits, bit 1 */
    byte TRM2        :1;                                       /* Trim Bits, bit 2 */
    byte TRM3        :1;                                       /* Trim Bits, bit 3 */
    byte TRM4        :1;                                       /* Trim Bits, bit 4 */
    byte TRM5        :1;                                       /* Trim Bits, bit 5 */
    byte TRM6        :1;                                       /* Trim Bits, bit 6 */
    byte TRM7        :1;                                       /* Trim Bits, bit 7 */
  } Bits;
} VREFTRMSTR;
extern volatile VREFTRMSTR _VREFTRM @0x0000005C;
#define VREFTRM                         _VREFTRM.Byte
#define VREFTRM_TRM0                    _VREFTRM.Bits.TRM0
#define VREFTRM_TRM1                    _VREFTRM.Bits.TRM1
#define VREFTRM_TRM2                    _VREFTRM.Bits.TRM2
#define VREFTRM_TRM3                    _VREFTRM.Bits.TRM3
#define VREFTRM_TRM4                    _VREFTRM.Bits.TRM4
#define VREFTRM_TRM5                    _VREFTRM.Bits.TRM5
#define VREFTRM_TRM6                    _VREFTRM.Bits.TRM6
#define VREFTRM_TRM7                    _VREFTRM.Bits.TRM7

#define VREFTRM_TRM0_MASK               1U
#define VREFTRM_TRM1_MASK               2U
#define VREFTRM_TRM2_MASK               4U
#define VREFTRM_TRM3_MASK               8U
#define VREFTRM_TRM4_MASK               16U
#define VREFTRM_TRM5_MASK               32U
#define VREFTRM_TRM6_MASK               64U
#define VREFTRM_TRM7_MASK               128U


/*** VREFSC - VREF Control Register; 0x0000005D ***/
typedef union {
  byte Byte;
  struct {
    byte MODE0       :1;                                       /* Mode selection, bit 0 */
    byte MODE1       :1;                                       /* Mode selection, bit 1 */
    byte VREFST      :1;                                       /* Internal Voltage Reference Stable */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte VREFEN      :1;                                       /* Internal Voltage Reference Enable */
  } Bits;
  struct {
    byte grpMODE :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} VREFSCSTR;
extern volatile VREFSCSTR _VREFSC @0x0000005D;
#define VREFSC                          _VREFSC.Byte
#define VREFSC_MODE0                    _VREFSC.Bits.MODE0
#define VREFSC_MODE1                    _VREFSC.Bits.MODE1
#define VREFSC_VREFST                   _VREFSC.Bits.VREFST
#define VREFSC_VREFEN                   _VREFSC.Bits.VREFEN
#define VREFSC_MODE                     _VREFSC.MergedBits.grpMODE

