rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
    /*** CMTCMD2 - CMT Modulator Data Register 2; 0x00001877 ***/
    union {
      byte Byte;
      struct {
        byte MB0         :1;                                       /* Data Value Bit 0 */
        byte MB1         :1;                                       /* Data Value Bit 1 */
        byte MB2         :1;                                       /* Data Value Bit 2 */
        byte MB3         :1;                                       /* Data Value Bit 3 */
        byte MB4         :1;                                       /* Data Value Bit 4 */
        byte MB5         :1;                                       /* Data Value Bit 5 */
        byte MB6         :1;                                       /* Data Value Bit 6 */
        byte MB7         :1;                                       /* Data Value Bit 7 */
      } Bits;
    } CMTCMD2STR;
    #define CMTCMD2                     _CMTCMD12.Overlap_STR.CMTCMD2STR.Byte
    #define CMTCMD2_MB0                 _CMTCMD12.Overlap_STR.CMTCMD2STR.Bits.MB0
    #define CMTCMD2_MB1                 _CMTCMD12.Overlap_STR.CMTCMD2STR.Bits.MB1
    #define CMTCMD2_MB2                 _CMTCMD12.Overlap_STR.CMTCMD2STR.Bits.MB2
    #define CMTCMD2_MB3                 _CMTCMD12.Overlap_STR.CMTCMD2STR.Bits.MB3
    #define CMTCMD2_MB4                 _CMTCMD12.Overlap_STR.CMTCMD2STR.Bits.MB4
    #define CMTCMD2_MB5                 _CMTCMD12.Overlap_STR.CMTCMD2STR.Bits.MB5
    #define CMTCMD2_MB6                 _CMTCMD12.Overlap_STR.CMTCMD2STR.Bits.MB6
    #define CMTCMD2_MB7                 _CMTCMD12.Overlap_STR.CMTCMD2STR.Bits.MB7
    
    #define CMTCMD2_MB0_MASK            1U
    #define CMTCMD2_MB1_MASK            2U
    #define CMTCMD2_MB2_MASK            4U
    #define CMTCMD2_MB3_MASK            8U
    #define CMTCMD2_MB4_MASK            16U
    #define CMTCMD2_MB5_MASK            32U
    #define CMTCMD2_MB6_MASK            64U
    #define CMTCMD2_MB7_MASK            128U
    
  } Overlap_STR;

} CMTCMD12STR;
extern volatile CMTCMD12STR _CMTCMD12 @0x00001876;
#define CMTCMD12                        _CMTCMD12.Word


/*** CMTCMD34 - CMT Modulator Data Register 34; 0x00001878 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** CMTCMD3 - CMT Modulator Data Register 3; 0x00001878 ***/
    union {
      byte Byte;
    } CMTCMD3STR;
    #define CMTCMD3                     _CMTCMD34.Overlap_STR.CMTCMD3STR.Byte
    

    /*** CMTCMD4 - CMT Modulator Data Register 4; 0x00001879 ***/
    union {
      byte Byte;
      struct {
        byte SB0         :1;                                       /* Data Value Bit 0 */
        byte SB1         :1;                                       /* Data Value Bit 1 */
        byte SB2         :1;                                       /* Data Value Bit 2 */
        byte SB3         :1;                                       /* Data Value Bit 3 */
        byte SB4         :1;                                       /* Data Value Bit 4 */
        byte SB5         :1;                                       /* Data Value Bit 5 */
        byte SB6         :1;                                       /* Data Value Bit 6 */
        byte SB7         :1;                                       /* Data Value Bit 7 */
      } Bits;
    } CMTCMD4STR;
    #define CMTCMD4                     _CMTCMD34.Overlap_STR.CMTCMD4STR.Byte
    #define CMTCMD4_SB0                 _CMTCMD34.Overlap_STR.CMTCMD4STR.Bits.SB0
    #define CMTCMD4_SB1                 _CMTCMD34.Overlap_STR.CMTCMD4STR.Bits.SB1
    #define CMTCMD4_SB2                 _CMTCMD34.Overlap_STR.CMTCMD4STR.Bits.SB2
    #define CMTCMD4_SB3                 _CMTCMD34.Overlap_STR.CMTCMD4STR.Bits.SB3
    #define CMTCMD4_SB4                 _CMTCMD34.Overlap_STR.CMTCMD4STR.Bits.SB4
    #define CMTCMD4_SB5                 _CMTCMD34.Overlap_STR.CMTCMD4STR.Bits.SB5
    #define CMTCMD4_SB6                 _CMTCMD34.Overlap_STR.CMTCMD4STR.Bits.SB6
    #define CMTCMD4_SB7                 _CMTCMD34.Overlap_STR.CMTCMD4STR.Bits.SB7
    
    #define CMTCMD4_SB0_MASK            1U
    #define CMTCMD4_SB1_MASK            2U
    #define CMTCMD4_SB2_MASK            4U
    #define CMTCMD4_SB3_MASK            8U
    #define CMTCMD4_SB4_MASK            16U
    #define CMTCMD4_SB5_MASK            32U
    #define CMTCMD4_SB6_MASK            64U
    #define CMTCMD4_SB7_MASK            128U
    
  } Overlap_STR;

} CMTCMD34STR;
extern volatile CMTCMD34STR _CMTCMD34 @0x00001878;
#define CMTCMD34                        _CMTCMD34.Word


/*** GPAMP1C0 - GPAMP1 Control Register 0; 0x0000187C ***/
typedef union {
  byte Byte;
  struct {
    byte MODE0       :1;                                       /* Mode selection bits, bit 0 */
    byte MODE1       :1;                                       /* Mode selection bits, bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LPEN        :1;                                       /* Low-power mode enable */
    byte GPAMPEN     :1;                                       /* OPAMP enable */
  } Bits;
  struct {
    byte grpMODE :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} GPAMP1C0STR;
extern volatile GPAMP1C0STR _GPAMP1C0 @0x0000187C;
#define GPAMP1C0                        _GPAMP1C0.Byte
#define GPAMP1C0_MODE0                  _GPAMP1C0.Bits.MODE0
#define GPAMP1C0_MODE1                  _GPAMP1C0.Bits.MODE1
#define GPAMP1C0_LPEN                   _GPAMP1C0.Bits.LPEN
#define GPAMP1C0_GPAMPEN                _GPAMP1C0.Bits.GPAMPEN
/* GPAMP1C_ARR: Access 3 GPAMP1Cx registers in an array */
#define GPAMP1C_ARR                     ((volatile byte * __far) &GPAMP1C0)
#define GPAMP1C0_MODE                   _GPAMP1C0.MergedBits.grpMODE

#define GPAMP1C0_MODE0_MASK             1U
#define GPAMP1C0_MODE1_MASK             2U
#define GPAMP1C0_LPEN_MASK              64U
#define GPAMP1C0_GPAMPEN_MASK           128U
#define GPAMP1C0_MODE_MASK              3U
#define GPAMP1C0_MODE_BITNUM            0U


/*** GPAMP1C1 - GPAMP1 Control Register 1; 0x0000187D ***/
typedef union {
  byte Byte;
  struct {
    byte AMPRI0      :1;                                       /* OPAMP Gains Selector, bit 0 */
    byte AMPRI1      :1;                                       /* OPAMP Gains Selector, bit 1 */
    byte AMPRF0      :1;                                       /* OPAMP Gains Selector, bit 0 */
    byte AMPRF1      :1;                                       /* OPAMP Gains Selector, bit 1 */
    byte AMPRF2      :1;                                       /* OPAMP Gains Selector, bit 2 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpAMPRI :2;
    byte grpAMPRF :3;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} GPAMP1C1STR;
extern volatile GPAMP1C1STR _GPAMP1C1 @0x0000187D;
#define GPAMP1C1                        _GPAMP1C1.Byte
#define GPAMP1C1_AMPRI0                 _GPAMP1C1.Bits.AMPRI0
#define GPAMP1C1_AMPRI1                 _GPAMP1C1.Bits.AMPRI1
#define GPAMP1C1_AMPRF0                 _GPAMP1C1.Bits.AMPRF0
#define GPAMP1C1_AMPRF1                 _GPAMP1C1.Bits.AMPRF1
#define GPAMP1C1_AMPRF2                 _GPAMP1C1.Bits.AMPRF2
#define GPAMP1C1_AMPRI                  _GPAMP1C1.MergedBits.grpAMPRI
#define GPAMP1C1_AMPRF                  _GPAMP1C1.MergedBits.grpAMPRF

#define GPAMP1C1_AMPRI0_MASK            1U
#define GPAMP1C1_AMPRI1_MASK            2U
#define GPAMP1C1_AMPRF0_MASK            4U
#define GPAMP1C1_AMPRF1_MASK            8U
#define GPAMP1C1_AMPRF2_MASK            16U
#define GPAMP1C1_AMPRI_MASK             3U
#define GPAMP1C1_AMPRI_BITNUM           0U
#define GPAMP1C1_AMPRF_MASK             28U
#define GPAMP1C1_AMPRF_BITNUM           2U


/*** GPAMP1C2 - GPAMP1 Control Register 2; 0x0000187E ***/
typedef union {
  byte Byte;
  struct {
    byte AMPNSEL0    :1;                                       /* Amplifier negative input terminal selector bits, bit 0 */
    byte AMPNSEL1    :1;                                       /* Amplifier negative input terminal selector bits, bit 1 */
    byte AMPNSEL2    :1;                                       /* Amplifier negative input terminal selector bits, bit 2 */
    byte             :1; 
    byte AMPPSEL0    :1;                                       /* Amplifier positive input terminal selector bits, bit 0 */
    byte AMPPSEL1    :1;                                       /* Amplifier positive input terminal selector bits, bit 1 */
    byte AMPPSEL2    :1;                                       /* Amplifier positive input terminal selector bits, bit 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpAMPNSEL :3;
    byte         :1;
    byte grpAMPPSEL :3;
    byte         :1;
  } MergedBits;
} GPAMP1C2STR;
extern volatile GPAMP1C2STR _GPAMP1C2 @0x0000187E;
#define GPAMP1C2                        _GPAMP1C2.Byte
#define GPAMP1C2_AMPNSEL0               _GPAMP1C2.Bits.AMPNSEL0
#define GPAMP1C2_AMPNSEL1               _GPAMP1C2.Bits.AMPNSEL1
#define GPAMP1C2_AMPNSEL2               _GPAMP1C2.Bits.AMPNSEL2
#define GPAMP1C2_AMPPSEL0               _GPAMP1C2.Bits.AMPPSEL0
#define GPAMP1C2_AMPPSEL1               _GPAMP1C2.Bits.AMPPSEL1
#define GPAMP1C2_AMPPSEL2               _GPAMP1C2.Bits.AMPPSEL2
#define GPAMP1C2_AMPNSEL                _GPAMP1C2.MergedBits.grpAMPNSEL
#define GPAMP1C2_AMPPSEL                _GPAMP1C2.MergedBits.grpAMPPSEL

