rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
extern volatile GPAMP2C1STR _GPAMP2C1 @0x00001899;
#define GPAMP2C1                        _GPAMP2C1.Byte
#define GPAMP2C1_AMPRI0                 _GPAMP2C1.Bits.AMPRI0
#define GPAMP2C1_AMPRI1                 _GPAMP2C1.Bits.AMPRI1
#define GPAMP2C1_AMPRF0                 _GPAMP2C1.Bits.AMPRF0
#define GPAMP2C1_AMPRF1                 _GPAMP2C1.Bits.AMPRF1
#define GPAMP2C1_AMPRF2                 _GPAMP2C1.Bits.AMPRF2
#define GPAMP2C1_AMPRI                  _GPAMP2C1.MergedBits.grpAMPRI
#define GPAMP2C1_AMPRF                  _GPAMP2C1.MergedBits.grpAMPRF

#define GPAMP2C1_AMPRI0_MASK            1U
#define GPAMP2C1_AMPRI1_MASK            2U
#define GPAMP2C1_AMPRF0_MASK            4U
#define GPAMP2C1_AMPRF1_MASK            8U
#define GPAMP2C1_AMPRF2_MASK            16U
#define GPAMP2C1_AMPRI_MASK             3U
#define GPAMP2C1_AMPRI_BITNUM           0U
#define GPAMP2C1_AMPRF_MASK             28U
#define GPAMP2C1_AMPRF_BITNUM           2U


/*** GPAMP2C2 - GPAMP2 Control Register 2; 0x0000189A ***/
typedef union {
  byte Byte;
  struct {
    byte AMPNSEL0    :1;                                       /* Amplifier negative input terminal selector bits, bit 0 */
    byte AMPNSEL1    :1;                                       /* Amplifier negative input terminal selector bits, bit 1 */
    byte AMPNSEL2    :1;                                       /* Amplifier negative input terminal selector bits, bit 2 */
    byte             :1; 
    byte AMPPSEL0    :1;                                       /* Amplifier positive input terminal selector bits, bit 0 */
    byte AMPPSEL1    :1;                                       /* Amplifier positive input terminal selector bits, bit 1 */
    byte AMPPSEL2    :1;                                       /* Amplifier positive input terminal selector bits, bit 2 */
    byte             :1; 
  } Bits;
  struct {
    byte grpAMPNSEL :3;
    byte         :1;
    byte grpAMPPSEL :3;
    byte         :1;
  } MergedBits;
} GPAMP2C2STR;
extern volatile GPAMP2C2STR _GPAMP2C2 @0x0000189A;
#define GPAMP2C2                        _GPAMP2C2.Byte
#define GPAMP2C2_AMPNSEL0               _GPAMP2C2.Bits.AMPNSEL0
#define GPAMP2C2_AMPNSEL1               _GPAMP2C2.Bits.AMPNSEL1
#define GPAMP2C2_AMPNSEL2               _GPAMP2C2.Bits.AMPNSEL2
#define GPAMP2C2_AMPPSEL0               _GPAMP2C2.Bits.AMPPSEL0
#define GPAMP2C2_AMPPSEL1               _GPAMP2C2.Bits.AMPPSEL1
#define GPAMP2C2_AMPPSEL2               _GPAMP2C2.Bits.AMPPSEL2
#define GPAMP2C2_AMPNSEL                _GPAMP2C2.MergedBits.grpAMPNSEL
#define GPAMP2C2_AMPPSEL                _GPAMP2C2.MergedBits.grpAMPPSEL

#define GPAMP2C2_AMPNSEL0_MASK          1U
#define GPAMP2C2_AMPNSEL1_MASK          2U
#define GPAMP2C2_AMPNSEL2_MASK          4U
#define GPAMP2C2_AMPPSEL0_MASK          16U
#define GPAMP2C2_AMPPSEL1_MASK          32U
#define GPAMP2C2_AMPPSEL2_MASK          64U
#define GPAMP2C2_AMPNSEL_MASK           7U
#define GPAMP2C2_AMPNSEL_BITNUM         0U
#define GPAMP2C2_AMPPSEL_MASK           112U
#define GPAMP2C2_AMPPSEL_BITNUM         4U


/*** TODC - TOD Control Register; 0x0000189C ***/
typedef union {
  byte Byte;
  struct {
    byte TODPS0      :1;                                       /* TOD Prescaler Bits, bit 0 */
    byte TODPS1      :1;                                       /* TOD Prescaler Bits, bit 1 */
    byte TODPS2      :1;                                       /* TOD Prescaler Bits, bit 2 */
    byte TODCLKEN    :1;                                       /* TOD Clock Enable */
    byte TODR        :1;                                       /* TOD Reset */
    byte TODCLKS0    :1;                                       /* TOD Clock Source, bit 0 */
    byte TODCLKS1    :1;                                       /* TOD Clock Source, bit 1 */
    byte TODEN       :1;                                       /* Time of Day Enable */
  } Bits;
  struct {
    byte grpTODPS :3;
    byte         :1;
    byte         :1;
    byte grpTODCLKS :2;
    byte         :1;
  } MergedBits;
} TODCSTR;
extern volatile TODCSTR _TODC @0x0000189C;
#define TODC                            _TODC.Byte
#define TODC_TODPS0                     _TODC.Bits.TODPS0
#define TODC_TODPS1                     _TODC.Bits.TODPS1
#define TODC_TODPS2                     _TODC.Bits.TODPS2
#define TODC_TODCLKEN                   _TODC.Bits.TODCLKEN
#define TODC_TODR                       _TODC.Bits.TODR
#define TODC_TODCLKS0                   _TODC.Bits.TODCLKS0
#define TODC_TODCLKS1                   _TODC.Bits.TODCLKS1
#define TODC_TODEN                      _TODC.Bits.TODEN
#define TODC_TODPS                      _TODC.MergedBits.grpTODPS
#define TODC_TODCLKS                    _TODC.MergedBits.grpTODCLKS

#define TODC_TODPS0_MASK                1U
#define TODC_TODPS1_MASK                2U
#define TODC_TODPS2_MASK                4U
#define TODC_TODCLKEN_MASK              8U
#define TODC_TODR_MASK                  16U
#define TODC_TODCLKS0_MASK              32U
#define TODC_TODCLKS1_MASK              64U
#define TODC_TODEN_MASK                 128U
#define TODC_TODPS_MASK                 7U
#define TODC_TODPS_BITNUM               0U
#define TODC_TODCLKS_MASK               96U
#define TODC_TODCLKS_BITNUM             5U


/*** TODSC - TOD Status and Control Register; 0x0000189D ***/
typedef union {
  byte Byte;
  struct {
    byte MTCHWC      :1;                                       /* Match Write Complete */
    byte MTCHEN      :1;                                       /* Match Function Enable */
    byte MTCHIE      :1;                                       /* Match Interrupt Enable */
    byte SECIE       :1;                                       /* Second Interrupt Enable */
    byte QSECIE      :1;                                       /* Quarter-Second Interrupt Enable */
    byte MTCHF       :1;                                       /* Match Interrupt Flag */
    byte SECF        :1;                                       /* Second Interrupt Flag */
    byte QSECF       :1;                                       /* Quarter-Second Interrupt Flag */
  } Bits;
} TODSCSTR;
extern volatile TODSCSTR _TODSC @0x0000189D;
#define TODSC                           _TODSC.Byte
#define TODSC_MTCHWC                    _TODSC.Bits.MTCHWC
#define TODSC_MTCHEN                    _TODSC.Bits.MTCHEN
#define TODSC_MTCHIE                    _TODSC.Bits.MTCHIE
#define TODSC_SECIE                     _TODSC.Bits.SECIE
#define TODSC_QSECIE                    _TODSC.Bits.QSECIE
#define TODSC_MTCHF                     _TODSC.Bits.MTCHF
#define TODSC_SECF                      _TODSC.Bits.SECF
#define TODSC_QSECF                     _TODSC.Bits.QSECF

#define TODSC_MTCHWC_MASK               1U
#define TODSC_MTCHEN_MASK               2U
#define TODSC_MTCHIE_MASK               4U
#define TODSC_SECIE_MASK                8U
#define TODSC_QSECIE_MASK               16U
#define TODSC_MTCHF_MASK                32U
#define TODSC_SECF_MASK                 64U
#define TODSC_QSECF_MASK                128U


/*** TODM - TOD Match Register; 0x0000189E ***/
typedef union {
  byte Byte;
  struct {
    byte MQSEC0      :1;                                       /* Match Quarter-Second Bits, bit 0 */
    byte MQSEC1      :1;                                       /* Match Quarter-Second Bits, bit 1 */
    byte TODM0       :1;                                       /* TOD Match Value, bit 0 */
    byte TODM1       :1;                                       /* TOD Match Value, bit 1 */
    byte TODM2       :1;                                       /* TOD Match Value, bit 2 */
    byte TODM3       :1;                                       /* TOD Match Value, bit 3 */
    byte TODM4       :1;                                       /* TOD Match Value, bit 4 */
    byte TODM5       :1;                                       /* TOD Match Value, bit 5 */
  } Bits;
  struct {
    byte grpMQSEC :2;
    byte grpTODM :6;
  } MergedBits;
} TODMSTR;
extern volatile TODMSTR _TODM @0x0000189E;
#define TODM                            _TODM.Byte
#define TODM_MQSEC0                     _TODM.Bits.MQSEC0
#define TODM_MQSEC1                     _TODM.Bits.MQSEC1
#define TODM_TODM0                      _TODM.Bits.TODM0
#define TODM_TODM1                      _TODM.Bits.TODM1
#define TODM_TODM2                      _TODM.Bits.TODM2
#define TODM_TODM3                      _TODM.Bits.TODM3
#define TODM_TODM4                      _TODM.Bits.TODM4
#define TODM_TODM5                      _TODM.Bits.TODM5
#define TODM_MQSEC                      _TODM.MergedBits.grpMQSEC
#define TODM_TODM                       _TODM.MergedBits.grpTODM

