rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
extern volatile PDBC2STR _PDBC2 @0x000018C2;
#define PDBC2                           _PDBC2.Byte
#define PDBC2_SWTRIG                    _PDBC2.Bits.SWTRIG
#define PDBC2_BB1                       _PDBC2.Bits.BB1
#define PDBC2_BB2                       _PDBC2.Bits.BB2
#define PDBC2_BB3                       _PDBC2.Bits.BB3
#define PDBC2_BB4                       _PDBC2.Bits.BB4
#define PDBC2_BB5                       _PDBC2.Bits.BB5
#define PDBC2_BB6                       _PDBC2.Bits.BB6
#define PDBC2_BB7                       _PDBC2.Bits.BB7
#define PDBC2_BB_1                      _PDBC2.MergedBits.grpBB_1
#define PDBC2_BB                        PDBC2_BB_1

#define PDBC2_SWTRIG_MASK               1U
#define PDBC2_BB1_MASK                  2U
#define PDBC2_BB2_MASK                  4U
#define PDBC2_BB3_MASK                  8U
#define PDBC2_BB4_MASK                  16U
#define PDBC2_BB5_MASK                  32U
#define PDBC2_BB6_MASK                  64U
#define PDBC2_BB7_MASK                  128U
#define PDBC2_BB_1_MASK                 254U
#define PDBC2_BB_1_BITNUM               1U


/*** PDBCHEN - PDB Channel Enable; 0x000018C3 ***/
typedef union {
  byte Byte;
  struct {
    byte CHEN0       :1;                                       /* PDB channel enable, bit 0 */
    byte CHEN1       :1;                                       /* PDB channel enable, bit 1 */
    byte CHEN2       :1;                                       /* PDB channel enable, bit 2 */
    byte CHEN3       :1;                                       /* PDB channel enable, bit 3 */
    byte CHEN4       :1;                                       /* PDB channel enable, bit 4 */
    byte CHEN5       :1;                                       /* PDB channel enable, bit 5 */
    byte CHEN6       :1;                                       /* PDB channel enable, bit 6 */
    byte CHEN7       :1;                                       /* PDB channel enable, bit 7 */
  } Bits;
} PDBCHENSTR;
extern volatile PDBCHENSTR _PDBCHEN @0x000018C3;
#define PDBCHEN                         _PDBCHEN.Byte
#define PDBCHEN_CHEN0                   _PDBCHEN.Bits.CHEN0
#define PDBCHEN_CHEN1                   _PDBCHEN.Bits.CHEN1
#define PDBCHEN_CHEN2                   _PDBCHEN.Bits.CHEN2
#define PDBCHEN_CHEN3                   _PDBCHEN.Bits.CHEN3
#define PDBCHEN_CHEN4                   _PDBCHEN.Bits.CHEN4
#define PDBCHEN_CHEN5                   _PDBCHEN.Bits.CHEN5
#define PDBCHEN_CHEN6                   _PDBCHEN.Bits.CHEN6
#define PDBCHEN_CHEN7                   _PDBCHEN.Bits.CHEN7

#define PDBCHEN_CHEN0_MASK              1U
#define PDBCHEN_CHEN1_MASK              2U
#define PDBCHEN_CHEN2_MASK              4U
#define PDBCHEN_CHEN3_MASK              8U
#define PDBCHEN_CHEN4_MASK              16U
#define PDBCHEN_CHEN5_MASK              32U
#define PDBCHEN_CHEN6_MASK              64U
#define PDBCHEN_CHEN7_MASK              128U


/*** PDBMOD - PDB Modulus Register; 0x000018C4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBMODH - PDB Modulus Register High; 0x000018C4 ***/
    union {
      byte Byte;
    } PDBMODHSTR;
    #define PDBMODH                     _PDBMOD.Overlap_STR.PDBMODHSTR.Byte
    

    /*** PDBMODL - PDB Modulus Register Low; 0x000018C5 ***/
    union {
      byte Byte;
    } PDBMODLSTR;
    #define PDBMODL                     _PDBMOD.Overlap_STR.PDBMODLSTR.Byte
    
  } Overlap_STR;

} PDBMODSTR;
extern volatile PDBMODSTR _PDBMOD @0x000018C4;
#define PDBMOD                          _PDBMOD.Word


/*** PDBCNT - PDB Counter Register; 0x000018C6 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBCNTH - PDB Counter Register High; 0x000018C6 ***/
    union {
      byte Byte;
    } PDBCNTHSTR;
    #define PDBCNTH                     _PDBCNT.Overlap_STR.PDBCNTHSTR.Byte
    

    /*** PDBCNTL - PDB Counter Register Low; 0x000018C7 ***/
    union {
      byte Byte;
    } PDBCNTLSTR;
    #define PDBCNTL                     _PDBCNT.Overlap_STR.PDBCNTLSTR.Byte
    
  } Overlap_STR;

} PDBCNTSTR;
extern volatile PDBCNTSTR _PDBCNT @0x000018C6;
#define PDBCNT                          _PDBCNT.Word


/*** PDBIDLY - PDB Interrupt Delay Register; 0x000018C8 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBIDLYH - PDB Interrupt Delay Register High; 0x000018C8 ***/
    union {
      byte Byte;
      struct {
        byte IDELAY8     :1;                                       /* Interrupt Delay, bit 8 */
        byte IDELAY9     :1;                                       /* Interrupt Delay, bit 9 */
        byte IDELAY10    :1;                                       /* Interrupt Delay, bit 10 */
        byte IDELAY11    :1;                                       /* Interrupt Delay, bit 11 */
        byte IDELAY12    :1;                                       /* Interrupt Delay, bit 12 */
        byte IDELAY13    :1;                                       /* Interrupt Delay, bit 13 */
        byte IDELAY14    :1;                                       /* Interrupt Delay, bit 14 */
        byte IDELAY15    :1;                                       /* Interrupt Delay, bit 15 */
      } Bits;
    } PDBIDLYHSTR;
    #define PDBIDLYH                    _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Byte
    #define PDBIDLYH_IDELAY8            _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Bits.IDELAY8
    #define PDBIDLYH_IDELAY9            _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Bits.IDELAY9
    #define PDBIDLYH_IDELAY10           _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Bits.IDELAY10
    #define PDBIDLYH_IDELAY11           _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Bits.IDELAY11
    #define PDBIDLYH_IDELAY12           _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Bits.IDELAY12
    #define PDBIDLYH_IDELAY13           _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Bits.IDELAY13
    #define PDBIDLYH_IDELAY14           _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Bits.IDELAY14
    #define PDBIDLYH_IDELAY15           _PDBIDLY.Overlap_STR.PDBIDLYHSTR.Bits.IDELAY15
    
    #define PDBIDLYH_IDELAY8_MASK       1U
    #define PDBIDLYH_IDELAY9_MASK       2U
    #define PDBIDLYH_IDELAY10_MASK      4U
    #define PDBIDLYH_IDELAY11_MASK      8U
    #define PDBIDLYH_IDELAY12_MASK      16U
    #define PDBIDLYH_IDELAY13_MASK      32U
    #define PDBIDLYH_IDELAY14_MASK      64U
    #define PDBIDLYH_IDELAY15_MASK      128U
    

