rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
    #define DACINTL_DACINT0_MASK        1U
    #define DACINTL_DACINT1_MASK        2U
    #define DACINTL_DACINT2_MASK        4U
    #define DACINTL_DACINT3_MASK        8U
    #define DACINTL_DACINT4_MASK        16U
    #define DACINTL_DACINT5_MASK        32U
    #define DACINTL_DACINT6_MASK        64U
    #define DACINTL_DACINT7_MASK        128U
    
  } Overlap_STR;

} DACINTSTR;
extern volatile DACINTSTR _DACINT @0x000018CA;
#define DACINT                          _DACINT.Word


/*** PDBDLYA - PDB Delay A Register; 0x000018CC ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYAH - PDB Delay A Register High; 0x000018CC ***/
    union {
      byte Byte;
      struct {
        byte DELAY8      :1;                                       /* Delay, bit 8 */
        byte DELAY9      :1;                                       /* Delay, bit 9 */
        byte DELAY10     :1;                                       /* Delay, bit 10 */
        byte DELAY11     :1;                                       /* Delay, bit 11 */
        byte DELAY12     :1;                                       /* Delay, bit 12 */
        byte DELAY13     :1;                                       /* Delay, bit 13 */
        byte DELAY14     :1;                                       /* Delay, bit 14 */
        byte DELAY15     :1;                                       /* Delay, bit 15 */
      } Bits;
    } PDBDLYAHSTR;
    #define PDBDLYAH                    _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Byte
    #define PDBDLYAH_DELAY8             _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAY8
    #define PDBDLYAH_DELAY9             _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAY9
    #define PDBDLYAH_DELAY10            _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAY10
    #define PDBDLYAH_DELAY11            _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAY11
    #define PDBDLYAH_DELAY12            _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAY12
    #define PDBDLYAH_DELAY13            _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAY13
    #define PDBDLYAH_DELAY14            _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAY14
    #define PDBDLYAH_DELAY15            _PDBDLYA.Overlap_STR.PDBDLYAHSTR.Bits.DELAY15
    
    #define PDBDLYAH_DELAY8_MASK        1U
    #define PDBDLYAH_DELAY9_MASK        2U
    #define PDBDLYAH_DELAY10_MASK       4U
    #define PDBDLYAH_DELAY11_MASK       8U
    #define PDBDLYAH_DELAY12_MASK       16U
    #define PDBDLYAH_DELAY13_MASK       32U
    #define PDBDLYAH_DELAY14_MASK       64U
    #define PDBDLYAH_DELAY15_MASK       128U
    

    /*** PDBDLYAL - PDB Delay A Register Low; 0x000018CD ***/
    union {
      byte Byte;
      struct {
        byte DELAY0      :1;                                       /* Delay, bit 0 */
        byte DELAY1      :1;                                       /* Delay, bit 1 */
        byte DELAY2      :1;                                       /* Delay, bit 2 */
        byte DELAY3      :1;                                       /* Delay, bit 3 */
        byte DELAY4      :1;                                       /* Delay, bit 4 */
        byte DELAY5      :1;                                       /* Delay, bit 5 */
        byte DELAY6      :1;                                       /* Delay, bit 6 */
        byte DELAY7      :1;                                       /* Delay, bit 7 */
      } Bits;
    } PDBDLYALSTR;
    #define PDBDLYAL                    _PDBDLYA.Overlap_STR.PDBDLYALSTR.Byte
    #define PDBDLYAL_DELAY0             _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAY0
    #define PDBDLYAL_DELAY1             _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAY1
    #define PDBDLYAL_DELAY2             _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAY2
    #define PDBDLYAL_DELAY3             _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAY3
    #define PDBDLYAL_DELAY4             _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAY4
    #define PDBDLYAL_DELAY5             _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAY5
    #define PDBDLYAL_DELAY6             _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAY6
    #define PDBDLYAL_DELAY7             _PDBDLYA.Overlap_STR.PDBDLYALSTR.Bits.DELAY7
    
    #define PDBDLYAL_DELAY0_MASK        1U
    #define PDBDLYAL_DELAY1_MASK        2U
    #define PDBDLYAL_DELAY2_MASK        4U
    #define PDBDLYAL_DELAY3_MASK        8U
    #define PDBDLYAL_DELAY4_MASK        16U
    #define PDBDLYAL_DELAY5_MASK        32U
    #define PDBDLYAL_DELAY6_MASK        64U
    #define PDBDLYAL_DELAY7_MASK        128U
    
  } Overlap_STR;

} PDBDLYASTR;
extern volatile PDBDLYASTR _PDBDLYA @0x000018CC;
#define PDBDLYA                         _PDBDLYA.Word


/*** PDBDLYB - PDB Delay B Register; 0x000018CE ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYBH - PDB Delay B Register High; 0x000018CE ***/
    union {
      byte Byte;
      struct {
        byte DELAY8      :1;                                       /* Delay, bit 8 */
        byte DELAY9      :1;                                       /* Delay, bit 9 */
        byte DELAY10     :1;                                       /* Delay, bit 10 */
        byte DELAY11     :1;                                       /* Delay, bit 11 */
        byte DELAY12     :1;                                       /* Delay, bit 12 */
        byte DELAY13     :1;                                       /* Delay, bit 13 */
        byte DELAY14     :1;                                       /* Delay, bit 14 */
        byte DELAY15     :1;                                       /* Delay, bit 15 */
      } Bits;
    } PDBDLYBHSTR;
    #define PDBDLYBH                    _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Byte
    #define PDBDLYBH_DELAY8             _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAY8
    #define PDBDLYBH_DELAY9             _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAY9
    #define PDBDLYBH_DELAY10            _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAY10
    #define PDBDLYBH_DELAY11            _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAY11
    #define PDBDLYBH_DELAY12            _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAY12
    #define PDBDLYBH_DELAY13            _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAY13
    #define PDBDLYBH_DELAY14            _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAY14
    #define PDBDLYBH_DELAY15            _PDBDLYB.Overlap_STR.PDBDLYBHSTR.Bits.DELAY15
    
    #define PDBDLYBH_DELAY8_MASK        1U
    #define PDBDLYBH_DELAY9_MASK        2U
    #define PDBDLYBH_DELAY10_MASK       4U
    #define PDBDLYBH_DELAY11_MASK       8U
    #define PDBDLYBH_DELAY12_MASK       16U
    #define PDBDLYBH_DELAY13_MASK       32U
    #define PDBDLYBH_DELAY14_MASK       64U
    #define PDBDLYBH_DELAY15_MASK       128U
    

