rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
    /*** PDBDLYBL - PDB Delay B Register Low; 0x000018CF ***/
    union {
      byte Byte;
      struct {
        byte DELAY0      :1;                                       /* Delay, bit 0 */
        byte DELAY1      :1;                                       /* Delay, bit 1 */
        byte DELAY2      :1;                                       /* Delay, bit 2 */
        byte DELAY3      :1;                                       /* Delay, bit 3 */
        byte DELAY4      :1;                                       /* Delay, bit 4 */
        byte DELAY5      :1;                                       /* Delay, bit 5 */
        byte DELAY6      :1;                                       /* Delay, bit 6 */
        byte DELAY7      :1;                                       /* Delay, bit 7 */
      } Bits;
    } PDBDLYBLSTR;
    #define PDBDLYBL                    _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Byte
    #define PDBDLYBL_DELAY0             _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAY0
    #define PDBDLYBL_DELAY1             _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAY1
    #define PDBDLYBL_DELAY2             _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAY2
    #define PDBDLYBL_DELAY3             _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAY3
    #define PDBDLYBL_DELAY4             _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAY4
    #define PDBDLYBL_DELAY5             _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAY5
    #define PDBDLYBL_DELAY6             _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAY6
    #define PDBDLYBL_DELAY7             _PDBDLYB.Overlap_STR.PDBDLYBLSTR.Bits.DELAY7
    
    #define PDBDLYBL_DELAY0_MASK        1U
    #define PDBDLYBL_DELAY1_MASK        2U
    #define PDBDLYBL_DELAY2_MASK        4U
    #define PDBDLYBL_DELAY3_MASK        8U
    #define PDBDLYBL_DELAY4_MASK        16U
    #define PDBDLYBL_DELAY5_MASK        32U
    #define PDBDLYBL_DELAY6_MASK        64U
    #define PDBDLYBL_DELAY7_MASK        128U
    
  } Overlap_STR;

} PDBDLYBSTR;
extern volatile PDBDLYBSTR _PDBDLYB @0x000018CE;
#define PDBDLYB                         _PDBDLYB.Word


/*** PDBDLYC - PDB Delay C Register; 0x000018D0 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYCH - PDB Delay C Register High; 0x000018D0 ***/
    union {
      byte Byte;
      struct {
        byte DELAY8      :1;                                       /* Delay, bit 8 */
        byte DELAY9      :1;                                       /* Delay, bit 9 */
        byte DELAY10     :1;                                       /* Delay, bit 10 */
        byte DELAY11     :1;                                       /* Delay, bit 11 */
        byte DELAY12     :1;                                       /* Delay, bit 12 */
        byte DELAY13     :1;                                       /* Delay, bit 13 */
        byte DELAY14     :1;                                       /* Delay, bit 14 */
        byte DELAY15     :1;                                       /* Delay, bit 15 */
      } Bits;
    } PDBDLYCHSTR;
    #define PDBDLYCH                    _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Byte
    #define PDBDLYCH_DELAY8             _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Bits.DELAY8
    #define PDBDLYCH_DELAY9             _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Bits.DELAY9
    #define PDBDLYCH_DELAY10            _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Bits.DELAY10
    #define PDBDLYCH_DELAY11            _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Bits.DELAY11
    #define PDBDLYCH_DELAY12            _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Bits.DELAY12
    #define PDBDLYCH_DELAY13            _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Bits.DELAY13
    #define PDBDLYCH_DELAY14            _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Bits.DELAY14
    #define PDBDLYCH_DELAY15            _PDBDLYC.Overlap_STR.PDBDLYCHSTR.Bits.DELAY15
    
    #define PDBDLYCH_DELAY8_MASK        1U
    #define PDBDLYCH_DELAY9_MASK        2U
    #define PDBDLYCH_DELAY10_MASK       4U
    #define PDBDLYCH_DELAY11_MASK       8U
    #define PDBDLYCH_DELAY12_MASK       16U
    #define PDBDLYCH_DELAY13_MASK       32U
    #define PDBDLYCH_DELAY14_MASK       64U
    #define PDBDLYCH_DELAY15_MASK       128U
    

    /*** PDBDLYCL - PDB Delay C Register Low; 0x000018D1 ***/
    union {
      byte Byte;
      struct {
        byte DELAY0      :1;                                       /* Delay, bit 0 */
        byte DELAY1      :1;                                       /* Delay, bit 1 */
        byte DELAY2      :1;                                       /* Delay, bit 2 */
        byte DELAY3      :1;                                       /* Delay, bit 3 */
        byte DELAY4      :1;                                       /* Delay, bit 4 */
        byte DELAY5      :1;                                       /* Delay, bit 5 */
        byte DELAY6      :1;                                       /* Delay, bit 6 */
        byte DELAY7      :1;                                       /* Delay, bit 7 */
      } Bits;
    } PDBDLYCLSTR;
    #define PDBDLYCL                    _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Byte
    #define PDBDLYCL_DELAY0             _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Bits.DELAY0
    #define PDBDLYCL_DELAY1             _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Bits.DELAY1
    #define PDBDLYCL_DELAY2             _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Bits.DELAY2
    #define PDBDLYCL_DELAY3             _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Bits.DELAY3
    #define PDBDLYCL_DELAY4             _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Bits.DELAY4
    #define PDBDLYCL_DELAY5             _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Bits.DELAY5
    #define PDBDLYCL_DELAY6             _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Bits.DELAY6
    #define PDBDLYCL_DELAY7             _PDBDLYC.Overlap_STR.PDBDLYCLSTR.Bits.DELAY7
    
    #define PDBDLYCL_DELAY0_MASK        1U
    #define PDBDLYCL_DELAY1_MASK        2U
    #define PDBDLYCL_DELAY2_MASK        4U
    #define PDBDLYCL_DELAY3_MASK        8U
    #define PDBDLYCL_DELAY4_MASK        16U
    #define PDBDLYCL_DELAY5_MASK        32U
    #define PDBDLYCL_DELAY6_MASK        64U
    #define PDBDLYCL_DELAY7_MASK        128U
    
  } Overlap_STR;

} PDBDLYCSTR;
extern volatile PDBDLYCSTR _PDBDLYC @0x000018D0;
#define PDBDLYC                         _PDBDLYC.Word


