rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
/*** PDBDLYD - PDB Delay D Register; 0x000018D2 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYDH - PDB Delay D Register High; 0x000018D2 ***/
    union {
      byte Byte;
      struct {
        byte DELAY8      :1;                                       /* Delay, bit 8 */
        byte DELAY9      :1;                                       /* Delay, bit 9 */
        byte DELAY10     :1;                                       /* Delay, bit 10 */
        byte DELAY11     :1;                                       /* Delay, bit 11 */
        byte DELAY12     :1;                                       /* Delay, bit 12 */
        byte DELAY13     :1;                                       /* Delay, bit 13 */
        byte DELAY14     :1;                                       /* Delay, bit 14 */
        byte DELAY15     :1;                                       /* Delay, bit 15 */
      } Bits;
    } PDBDLYDHSTR;
    #define PDBDLYDH                    _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Byte
    #define PDBDLYDH_DELAY8             _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Bits.DELAY8
    #define PDBDLYDH_DELAY9             _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Bits.DELAY9
    #define PDBDLYDH_DELAY10            _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Bits.DELAY10
    #define PDBDLYDH_DELAY11            _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Bits.DELAY11
    #define PDBDLYDH_DELAY12            _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Bits.DELAY12
    #define PDBDLYDH_DELAY13            _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Bits.DELAY13
    #define PDBDLYDH_DELAY14            _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Bits.DELAY14
    #define PDBDLYDH_DELAY15            _PDBDLYD.Overlap_STR.PDBDLYDHSTR.Bits.DELAY15
    
    #define PDBDLYDH_DELAY8_MASK        1U
    #define PDBDLYDH_DELAY9_MASK        2U
    #define PDBDLYDH_DELAY10_MASK       4U
    #define PDBDLYDH_DELAY11_MASK       8U
    #define PDBDLYDH_DELAY12_MASK       16U
    #define PDBDLYDH_DELAY13_MASK       32U
    #define PDBDLYDH_DELAY14_MASK       64U
    #define PDBDLYDH_DELAY15_MASK       128U
    

    /*** PDBDLYDL - PDB Delay D Register Low; 0x000018D3 ***/
    union {
      byte Byte;
      struct {
        byte DELAY0      :1;                                       /* Delay, bit 0 */
        byte DELAY1      :1;                                       /* Delay, bit 1 */
        byte DELAY2      :1;                                       /* Delay, bit 2 */
        byte DELAY3      :1;                                       /* Delay, bit 3 */
        byte DELAY4      :1;                                       /* Delay, bit 4 */
        byte DELAY5      :1;                                       /* Delay, bit 5 */
        byte DELAY6      :1;                                       /* Delay, bit 6 */
        byte DELAY7      :1;                                       /* Delay, bit 7 */
      } Bits;
    } PDBDLYDLSTR;
    #define PDBDLYDL                    _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Byte
    #define PDBDLYDL_DELAY0             _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Bits.DELAY0
    #define PDBDLYDL_DELAY1             _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Bits.DELAY1
    #define PDBDLYDL_DELAY2             _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Bits.DELAY2
    #define PDBDLYDL_DELAY3             _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Bits.DELAY3
    #define PDBDLYDL_DELAY4             _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Bits.DELAY4
    #define PDBDLYDL_DELAY5             _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Bits.DELAY5
    #define PDBDLYDL_DELAY6             _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Bits.DELAY6
    #define PDBDLYDL_DELAY7             _PDBDLYD.Overlap_STR.PDBDLYDLSTR.Bits.DELAY7
    
    #define PDBDLYDL_DELAY0_MASK        1U
    #define PDBDLYDL_DELAY1_MASK        2U
    #define PDBDLYDL_DELAY2_MASK        4U
    #define PDBDLYDL_DELAY3_MASK        8U
    #define PDBDLYDL_DELAY4_MASK        16U
    #define PDBDLYDL_DELAY5_MASK        32U
    #define PDBDLYDL_DELAY6_MASK        64U
    #define PDBDLYDL_DELAY7_MASK        128U
    
  } Overlap_STR;

} PDBDLYDSTR;
extern volatile PDBDLYDSTR _PDBDLYD @0x000018D2;
#define PDBDLYD                         _PDBDLYD.Word


/*** PDBDLYE - PDB Delay E Register; 0x000018D4 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYEH - PDB Delay E Register High; 0x000018D4 ***/
    union {
      byte Byte;
      struct {
        byte DELAY8      :1;                                       /* Delay, bit 8 */
        byte DELAY9      :1;                                       /* Delay, bit 9 */
        byte DELAY10     :1;                                       /* Delay, bit 10 */
        byte DELAY11     :1;                                       /* Delay, bit 11 */
        byte DELAY12     :1;                                       /* Delay, bit 12 */
        byte DELAY13     :1;                                       /* Delay, bit 13 */
        byte DELAY14     :1;                                       /* Delay, bit 14 */
        byte DELAY15     :1;                                       /* Delay, bit 15 */
      } Bits;
    } PDBDLYEHSTR;
    #define PDBDLYEH                    _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Byte
    #define PDBDLYEH_DELAY8             _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Bits.DELAY8
    #define PDBDLYEH_DELAY9             _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Bits.DELAY9
    #define PDBDLYEH_DELAY10            _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Bits.DELAY10
    #define PDBDLYEH_DELAY11            _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Bits.DELAY11
    #define PDBDLYEH_DELAY12            _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Bits.DELAY12
    #define PDBDLYEH_DELAY13            _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Bits.DELAY13
    #define PDBDLYEH_DELAY14            _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Bits.DELAY14
    #define PDBDLYEH_DELAY15            _PDBDLYE.Overlap_STR.PDBDLYEHSTR.Bits.DELAY15
    
    #define PDBDLYEH_DELAY8_MASK        1U
    #define PDBDLYEH_DELAY9_MASK        2U
    #define PDBDLYEH_DELAY10_MASK       4U
    #define PDBDLYEH_DELAY11_MASK       8U
    #define PDBDLYEH_DELAY12_MASK       16U
    #define PDBDLYEH_DELAY13_MASK       32U
    #define PDBDLYEH_DELAY14_MASK       64U
    #define PDBDLYEH_DELAY15_MASK       128U
    

    /*** PDBDLYEL - PDB Delay E Register Low; 0x000018D5 ***/
    union {
      byte Byte;
      struct {
        byte DELAY0      :1;                                       /* Delay, bit 0 */
        byte DELAY1      :1;                                       /* Delay, bit 1 */
        byte DELAY2      :1;                                       /* Delay, bit 2 */
        byte DELAY3      :1;                                       /* Delay, bit 3 */
        byte DELAY4      :1;                                       /* Delay, bit 4 */
        byte DELAY5      :1;                                       /* Delay, bit 5 */
        byte DELAY6      :1;                                       /* Delay, bit 6 */
        byte DELAY7      :1;                                       /* Delay, bit 7 */
      } Bits;
    } PDBDLYELSTR;
    #define PDBDLYEL                    _PDBDLYE.Overlap_STR.PDBDLYELSTR.Byte
    #define PDBDLYEL_DELAY0             _PDBDLYE.Overlap_STR.PDBDLYELSTR.Bits.DELAY0
    #define PDBDLYEL_DELAY1             _PDBDLYE.Overlap_STR.PDBDLYELSTR.Bits.DELAY1
    #define PDBDLYEL_DELAY2             _PDBDLYE.Overlap_STR.PDBDLYELSTR.Bits.DELAY2
    #define PDBDLYEL_DELAY3             _PDBDLYE.Overlap_STR.PDBDLYELSTR.Bits.DELAY3
    #define PDBDLYEL_DELAY4             _PDBDLYE.Overlap_STR.PDBDLYELSTR.Bits.DELAY4
    #define PDBDLYEL_DELAY5             _PDBDLYE.Overlap_STR.PDBDLYELSTR.Bits.DELAY5
    #define PDBDLYEL_DELAY6             _PDBDLYE.Overlap_STR.PDBDLYELSTR.Bits.DELAY6
    #define PDBDLYEL_DELAY7             _PDBDLYE.Overlap_STR.PDBDLYELSTR.Bits.DELAY7
    
