rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
    #define PDBDLYEL_DELAY0_MASK        1U
    #define PDBDLYEL_DELAY1_MASK        2U
    #define PDBDLYEL_DELAY2_MASK        4U
    #define PDBDLYEL_DELAY3_MASK        8U
    #define PDBDLYEL_DELAY4_MASK        16U
    #define PDBDLYEL_DELAY5_MASK        32U
    #define PDBDLYEL_DELAY6_MASK        64U
    #define PDBDLYEL_DELAY7_MASK        128U
    
  } Overlap_STR;

} PDBDLYESTR;
extern volatile PDBDLYESTR _PDBDLYE @0x000018D4;
#define PDBDLYE                         _PDBDLYE.Word


/*** PDBDLYF - PDB Delay F Register; 0x000018D6 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYFH - PDB Delay F Register High; 0x000018D6 ***/
    union {
      byte Byte;
      struct {
        byte DELAY8      :1;                                       /* Delay, bit 8 */
        byte DELAY9      :1;                                       /* Delay, bit 9 */
        byte DELAY10     :1;                                       /* Delay, bit 10 */
        byte DELAY11     :1;                                       /* Delay, bit 11 */
        byte DELAY12     :1;                                       /* Delay, bit 12 */
        byte DELAY13     :1;                                       /* Delay, bit 13 */
        byte DELAY14     :1;                                       /* Delay, bit 14 */
        byte DELAY15     :1;                                       /* Delay, bit 15 */
      } Bits;
    } PDBDLYFHSTR;
    #define PDBDLYFH                    _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Byte
    #define PDBDLYFH_DELAY8             _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Bits.DELAY8
    #define PDBDLYFH_DELAY9             _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Bits.DELAY9
    #define PDBDLYFH_DELAY10            _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Bits.DELAY10
    #define PDBDLYFH_DELAY11            _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Bits.DELAY11
    #define PDBDLYFH_DELAY12            _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Bits.DELAY12
    #define PDBDLYFH_DELAY13            _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Bits.DELAY13
    #define PDBDLYFH_DELAY14            _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Bits.DELAY14
    #define PDBDLYFH_DELAY15            _PDBDLYF.Overlap_STR.PDBDLYFHSTR.Bits.DELAY15
    
    #define PDBDLYFH_DELAY8_MASK        1U
    #define PDBDLYFH_DELAY9_MASK        2U
    #define PDBDLYFH_DELAY10_MASK       4U
    #define PDBDLYFH_DELAY11_MASK       8U
    #define PDBDLYFH_DELAY12_MASK       16U
    #define PDBDLYFH_DELAY13_MASK       32U
    #define PDBDLYFH_DELAY14_MASK       64U
    #define PDBDLYFH_DELAY15_MASK       128U
    

    /*** PDBDLYFL - PDB Delay F Register Low; 0x000018D7 ***/
    union {
      byte Byte;
      struct {
        byte DELAY0      :1;                                       /* Delay, bit 0 */
        byte DELAY1      :1;                                       /* Delay, bit 1 */
        byte DELAY2      :1;                                       /* Delay, bit 2 */
        byte DELAY3      :1;                                       /* Delay, bit 3 */
        byte DELAY4      :1;                                       /* Delay, bit 4 */
        byte DELAY5      :1;                                       /* Delay, bit 5 */
        byte DELAY6      :1;                                       /* Delay, bit 6 */
        byte DELAY7      :1;                                       /* Delay, bit 7 */
      } Bits;
    } PDBDLYFLSTR;
    #define PDBDLYFL                    _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Byte
    #define PDBDLYFL_DELAY0             _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Bits.DELAY0
    #define PDBDLYFL_DELAY1             _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Bits.DELAY1
    #define PDBDLYFL_DELAY2             _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Bits.DELAY2
    #define PDBDLYFL_DELAY3             _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Bits.DELAY3
    #define PDBDLYFL_DELAY4             _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Bits.DELAY4
    #define PDBDLYFL_DELAY5             _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Bits.DELAY5
    #define PDBDLYFL_DELAY6             _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Bits.DELAY6
    #define PDBDLYFL_DELAY7             _PDBDLYF.Overlap_STR.PDBDLYFLSTR.Bits.DELAY7
    
    #define PDBDLYFL_DELAY0_MASK        1U
    #define PDBDLYFL_DELAY1_MASK        2U
    #define PDBDLYFL_DELAY2_MASK        4U
    #define PDBDLYFL_DELAY3_MASK        8U
    #define PDBDLYFL_DELAY4_MASK        16U
    #define PDBDLYFL_DELAY5_MASK        32U
    #define PDBDLYFL_DELAY6_MASK        64U
    #define PDBDLYFL_DELAY7_MASK        128U
    
  } Overlap_STR;

} PDBDLYFSTR;
extern volatile PDBDLYFSTR _PDBDLYF @0x000018D6;
#define PDBDLYF                         _PDBDLYF.Word


/*** PDBDLYG - PDB Delay G Register; 0x000018D8 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYGH - PDB Delay G Register High; 0x000018D8 ***/
    union {
      byte Byte;
      struct {
        byte DELAY8      :1;                                       /* Delay, bit 8 */
        byte DELAY9      :1;                                       /* Delay, bit 9 */
        byte DELAY10     :1;                                       /* Delay, bit 10 */
        byte DELAY11     :1;                                       /* Delay, bit 11 */
        byte DELAY12     :1;                                       /* Delay, bit 12 */
        byte DELAY13     :1;                                       /* Delay, bit 13 */
        byte DELAY14     :1;                                       /* Delay, bit 14 */
        byte DELAY15     :1;                                       /* Delay, bit 15 */
      } Bits;
    } PDBDLYGHSTR;
    #define PDBDLYGH                    _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Byte
    #define PDBDLYGH_DELAY8             _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Bits.DELAY8
    #define PDBDLYGH_DELAY9             _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Bits.DELAY9
    #define PDBDLYGH_DELAY10            _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Bits.DELAY10
    #define PDBDLYGH_DELAY11            _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Bits.DELAY11
    #define PDBDLYGH_DELAY12            _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Bits.DELAY12
    #define PDBDLYGH_DELAY13            _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Bits.DELAY13
    #define PDBDLYGH_DELAY14            _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Bits.DELAY14
    #define PDBDLYGH_DELAY15            _PDBDLYG.Overlap_STR.PDBDLYGHSTR.Bits.DELAY15
    
    #define PDBDLYGH_DELAY8_MASK        1U
    #define PDBDLYGH_DELAY9_MASK        2U
    #define PDBDLYGH_DELAY10_MASK       4U
    #define PDBDLYGH_DELAY11_MASK       8U
    #define PDBDLYGH_DELAY12_MASK       16U
    #define PDBDLYGH_DELAY13_MASK       32U
    #define PDBDLYGH_DELAY14_MASK       64U
    #define PDBDLYGH_DELAY15_MASK       128U
    

    /*** PDBDLYGL - PDB Delay G Register Low; 0x000018D9 ***/
    union {
      byte Byte;
      struct {
        byte DELAY0      :1;                                       /* Delay, bit 0 */
        byte DELAY1      :1;                                       /* Delay, bit 1 */
        byte DELAY2      :1;                                       /* Delay, bit 2 */
        byte DELAY3      :1;                                       /* Delay, bit 3 */
        byte DELAY4      :1;                                       /* Delay, bit 4 */
        byte DELAY5      :1;                                       /* Delay, bit 5 */
        byte DELAY6      :1;                                       /* Delay, bit 6 */
        byte DELAY7      :1;                                       /* Delay, bit 7 */
      } Bits;
    } PDBDLYGLSTR;
    #define PDBDLYGL                    _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Byte
    #define PDBDLYGL_DELAY0             _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Bits.DELAY0
    #define PDBDLYGL_DELAY1             _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Bits.DELAY1
    #define PDBDLYGL_DELAY2             _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Bits.DELAY2
    #define PDBDLYGL_DELAY3             _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Bits.DELAY3
    #define PDBDLYGL_DELAY4             _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Bits.DELAY4
    #define PDBDLYGL_DELAY5             _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Bits.DELAY5
    #define PDBDLYGL_DELAY6             _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Bits.DELAY6
    #define PDBDLYGL_DELAY7             _PDBDLYG.Overlap_STR.PDBDLYGLSTR.Bits.DELAY7
    
    #define PDBDLYGL_DELAY0_MASK        1U
    #define PDBDLYGL_DELAY1_MASK        2U
    #define PDBDLYGL_DELAY2_MASK        4U
    #define PDBDLYGL_DELAY3_MASK        8U
    #define PDBDLYGL_DELAY4_MASK        16U
    #define PDBDLYGL_DELAY5_MASK        32U
    #define PDBDLYGL_DELAY6_MASK        64U
    #define PDBDLYGL_DELAY7_MASK        128U
    
  } Overlap_STR;

} PDBDLYGSTR;
extern volatile PDBDLYGSTR _PDBDLYG @0x000018D8;
#define PDBDLYG                         _PDBDLYG.Word


/*** PDBDLYH - PDB Delay H Register; 0x000018DA ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PDBDLYHH - PDB Delay H Register High; 0x000018DA ***/
    union {
      byte Byte;
      struct {
        byte DELAY8      :1;                                       /* Delay, bit 8 */
        byte DELAY9      :1;                                       /* Delay, bit 9 */
        byte DELAY10     :1;                                       /* Delay, bit 10 */
        byte DELAY11     :1;                                       /* Delay, bit 11 */
        byte DELAY12     :1;                                       /* Delay, bit 12 */
        byte DELAY13     :1;                                       /* Delay, bit 13 */
        byte DELAY14     :1;                                       /* Delay, bit 14 */
        byte DELAY15     :1;                                       /* Delay, bit 15 */
      } Bits;
    } PDBDLYHHSTR;
    #define PDBDLYHH                    _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Byte
    #define PDBDLYHH_DELAY8             _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Bits.DELAY8
    #define PDBDLYHH_DELAY9             _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Bits.DELAY9
    #define PDBDLYHH_DELAY10            _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Bits.DELAY10
    #define PDBDLYHH_DELAY11            _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Bits.DELAY11
    #define PDBDLYHH_DELAY12            _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Bits.DELAY12
    #define PDBDLYHH_DELAY13            _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Bits.DELAY13
    #define PDBDLYHH_DELAY14            _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Bits.DELAY14
    #define PDBDLYHH_DELAY15            _PDBDLYH.Overlap_STR.PDBDLYHHSTR.Bits.DELAY15
    
    #define PDBDLYHH_DELAY8_MASK        1U
    #define PDBDLYHH_DELAY9_MASK        2U
    #define PDBDLYHH_DELAY10_MASK       4U
    #define PDBDLYHH_DELAY11_MASK       8U
    #define PDBDLYHH_DELAY12_MASK       16U
    #define PDBDLYHH_DELAY13_MASK       32U
    #define PDBDLYHH_DELAY14_MASK       64U
    #define PDBDLYHH_DELAY15_MASK       128U
    

    /*** PDBDLYHL - PDB Delay H Register Low; 0x000018DB ***/
    union {
      byte Byte;
      struct {
        byte DELAY0      :1;                                       /* Delay, bit 0 */
        byte DELAY1      :1;                                       /* Delay, bit 1 */
        byte DELAY2      :1;                                       /* Delay, bit 2 */
        byte DELAY3      :1;                                       /* Delay, bit 3 */
        byte DELAY4      :1;                                       /* Delay, bit 4 */
        byte DELAY5      :1;                                       /* Delay, bit 5 */
        byte DELAY6      :1;                                       /* Delay, bit 6 */
        byte DELAY7      :1;                                       /* Delay, bit 7 */
      } Bits;
    } PDBDLYHLSTR;
    #define PDBDLYHL                    _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Byte
    #define PDBDLYHL_DELAY0             _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Bits.DELAY0
    #define PDBDLYHL_DELAY1             _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Bits.DELAY1
    #define PDBDLYHL_DELAY2             _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Bits.DELAY2
    #define PDBDLYHL_DELAY3             _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Bits.DELAY3
    #define PDBDLYHL_DELAY4             _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Bits.DELAY4
    #define PDBDLYHL_DELAY5             _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Bits.DELAY5
    #define PDBDLYHL_DELAY6             _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Bits.DELAY6
    #define PDBDLYHL_DELAY7             _PDBDLYH.Overlap_STR.PDBDLYHLSTR.Bits.DELAY7
    
    #define PDBDLYHL_DELAY0_MASK        1U
    #define PDBDLYHL_DELAY1_MASK        2U
    #define PDBDLYHL_DELAY2_MASK        4U
    #define PDBDLYHL_DELAY3_MASK        8U
    #define PDBDLYHL_DELAY4_MASK        16U
    #define PDBDLYHL_DELAY5_MASK        32U
    #define PDBDLYHL_DELAY6_MASK        64U
    #define PDBDLYHL_DELAY7_MASK        128U
    
  } Overlap_STR;

