rngadam/XinCheJian-experiments/STAR-XL-S08/java/BasicInputOutput/Project_Headers/mc9s08mm128.h
#define NVBACKKEY5_KEY0_MASK            1U
#define NVBACKKEY5_KEY1_MASK            2U
#define NVBACKKEY5_KEY2_MASK            4U
#define NVBACKKEY5_KEY3_MASK            8U
#define NVBACKKEY5_KEY4_MASK            16U
#define NVBACKKEY5_KEY5_MASK            32U
#define NVBACKKEY5_KEY6_MASK            64U
#define NVBACKKEY5_KEY7_MASK            128U


/*** NVBACKKEY6 - Backdoor Comparison Key 6; 0x0000FFB6 ***/
typedef union {
  byte Byte;
  struct {
    byte KEY0        :1;                                       /* Backdoor Comparison Key 6 Bits, bit 0 */
    byte KEY1        :1;                                       /* Backdoor Comparison Key 6 Bits, bit 1 */
    byte KEY2        :1;                                       /* Backdoor Comparison Key 6 Bits, bit 2 */
    byte KEY3        :1;                                       /* Backdoor Comparison Key 6 Bits, bit 3 */
    byte KEY4        :1;                                       /* Backdoor Comparison Key 6 Bits, bit 4 */
    byte KEY5        :1;                                       /* Backdoor Comparison Key 6 Bits, bit 5 */
    byte KEY6        :1;                                       /* Backdoor Comparison Key 6 Bits, bit 6 */
    byte KEY7        :1;                                       /* Backdoor Comparison Key 6 Bits, bit 7 */
  } Bits;
} NVBACKKEY6STR;
/* Tip for register initialization in the user code:  const byte NVBACKKEY6_INIT @0x0000FFB6 = <NVBACKKEY6_INITVAL>; */
#define _NVBACKKEY6 (*(const NVBACKKEY6STR * __far)0x0000FFB6)
#define NVBACKKEY6                      _NVBACKKEY6.Byte
#define NVBACKKEY6_KEY0                 _NVBACKKEY6.Bits.KEY0
#define NVBACKKEY6_KEY1                 _NVBACKKEY6.Bits.KEY1
#define NVBACKKEY6_KEY2                 _NVBACKKEY6.Bits.KEY2
#define NVBACKKEY6_KEY3                 _NVBACKKEY6.Bits.KEY3
#define NVBACKKEY6_KEY4                 _NVBACKKEY6.Bits.KEY4
#define NVBACKKEY6_KEY5                 _NVBACKKEY6.Bits.KEY5
#define NVBACKKEY6_KEY6                 _NVBACKKEY6.Bits.KEY6
#define NVBACKKEY6_KEY7                 _NVBACKKEY6.Bits.KEY7

#define NVBACKKEY6_KEY0_MASK            1U
#define NVBACKKEY6_KEY1_MASK            2U
#define NVBACKKEY6_KEY2_MASK            4U
#define NVBACKKEY6_KEY3_MASK            8U
#define NVBACKKEY6_KEY4_MASK            16U
#define NVBACKKEY6_KEY5_MASK            32U
#define NVBACKKEY6_KEY6_MASK            64U
#define NVBACKKEY6_KEY7_MASK            128U


/*** NVBACKKEY7 - Backdoor Comparison Key 7; 0x0000FFB7 ***/
typedef union {
  byte Byte;
  struct {
    byte KEY0        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 0 */
    byte KEY1        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 1 */
    byte KEY2        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 2 */
    byte KEY3        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 3 */
    byte KEY4        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 4 */
    byte KEY5        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 5 */
    byte KEY6        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 6 */
    byte KEY7        :1;                                       /* Backdoor Comparison Key 7 Bits, bit 7 */
  } Bits;
} NVBACKKEY7STR;
/* Tip for register initialization in the user code:  const byte NVBACKKEY7_INIT @0x0000FFB7 = <NVBACKKEY7_INITVAL>; */
#define _NVBACKKEY7 (*(const NVBACKKEY7STR * __far)0x0000FFB7)
#define NVBACKKEY7                      _NVBACKKEY7.Byte
#define NVBACKKEY7_KEY0                 _NVBACKKEY7.Bits.KEY0
#define NVBACKKEY7_KEY1                 _NVBACKKEY7.Bits.KEY1
#define NVBACKKEY7_KEY2                 _NVBACKKEY7.Bits.KEY2
#define NVBACKKEY7_KEY3                 _NVBACKKEY7.Bits.KEY3
#define NVBACKKEY7_KEY4                 _NVBACKKEY7.Bits.KEY4
#define NVBACKKEY7_KEY5                 _NVBACKKEY7.Bits.KEY5
#define NVBACKKEY7_KEY6                 _NVBACKKEY7.Bits.KEY6
#define NVBACKKEY7_KEY7                 _NVBACKKEY7.Bits.KEY7

#define NVBACKKEY7_KEY0_MASK            1U
#define NVBACKKEY7_KEY1_MASK            2U
#define NVBACKKEY7_KEY2_MASK            4U
#define NVBACKKEY7_KEY3_MASK            8U
#define NVBACKKEY7_KEY4_MASK            16U
#define NVBACKKEY7_KEY5_MASK            32U
#define NVBACKKEY7_KEY6_MASK            64U
#define NVBACKKEY7_KEY7_MASK            128U


/*** FCHKS - Flash Checksum Register; 0x0000FFB8 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** FCHKSH - Flash Checksum Register High Byte; 0x0000FFB8 ***/
    union {
      byte Byte;
      struct {
        byte CHECKSUM8   :1;                                       /* Flash checksum bit 8 */
        byte CHECKSUM9   :1;                                       /* Flash checksum bit 9 */
        byte CHECKSUM10  :1;                                       /* Flash checksum bit 10 */
        byte CHECKSUM11  :1;                                       /* Flash checksum bit 11 */
        byte CHECKSUM12  :1;                                       /* Flash checksum bit 12 */
        byte CHECKSUM13  :1;                                       /* Flash checksum bit 13 */
        byte CHECKSUM14  :1;                                       /* Flash checksum bit 14 */
        byte CHECKSUM15  :1;                                       /* Flash checksum bit 15 */
      } Bits;
    } FCHKSHSTR;
    #define FCHKSH                      _FCHKS.Overlap_STR.FCHKSHSTR.Byte
    #define FCHKSH_CHECKSUM8            _FCHKS.Overlap_STR.FCHKSHSTR.Bits.CHECKSUM8
    #define FCHKSH_CHECKSUM9            _FCHKS.Overlap_STR.FCHKSHSTR.Bits.CHECKSUM9
    #define FCHKSH_CHECKSUM10           _FCHKS.Overlap_STR.FCHKSHSTR.Bits.CHECKSUM10
    #define FCHKSH_CHECKSUM11           _FCHKS.Overlap_STR.FCHKSHSTR.Bits.CHECKSUM11
    #define FCHKSH_CHECKSUM12           _FCHKS.Overlap_STR.FCHKSHSTR.Bits.CHECKSUM12
    #define FCHKSH_CHECKSUM13           _FCHKS.Overlap_STR.FCHKSHSTR.Bits.CHECKSUM13
    #define FCHKSH_CHECKSUM14           _FCHKS.Overlap_STR.FCHKSHSTR.Bits.CHECKSUM14
    #define FCHKSH_CHECKSUM15           _FCHKS.Overlap_STR.FCHKSHSTR.Bits.CHECKSUM15
    
    #define FCHKSH_CHECKSUM8_MASK       1U
    #define FCHKSH_CHECKSUM9_MASK       2U
    #define FCHKSH_CHECKSUM10_MASK      4U
    #define FCHKSH_CHECKSUM11_MASK      8U
    #define FCHKSH_CHECKSUM12_MASK      16U
    #define FCHKSH_CHECKSUM13_MASK      32U
    #define FCHKSH_CHECKSUM14_MASK      64U
    #define FCHKSH_CHECKSUM15_MASK      128U
    

    /*** FCHKSL - Flash Checksum Register Low Byte; 0x0000FFB9 ***/
    union {
      byte Byte;
      struct {
        byte CHECKSUM0   :1;                                       /* Flash checksum bits, bit 0 */
        byte CHECKSUM1   :1;                                       /* Flash checksum bits, bit 1 */
        byte CHECKSUM2   :1;                                       /* Flash checksum bits, bit 2 */
        byte CHECKSUM3   :1;                                       /* Flash checksum bits, bit 3 */
        byte CHECKSUM4   :1;                                       /* Flash checksum bits, bit 4 */
        byte CHECKSUM5   :1;                                       /* Flash checksum bits, bit 5 */
        byte CHECKSUM6   :1;                                       /* Flash checksum bits, bit 6 */
        byte CHECKSUM7   :1;                                       /* Flash checksum bits, bit 7 */
      } Bits;
    } FCHKSLSTR;
    #define FCHKSL                      _FCHKS.Overlap_STR.FCHKSLSTR.Byte
    #define FCHKSL_CHECKSUM0            _FCHKS.Overlap_STR.FCHKSLSTR.Bits.CHECKSUM0
    #define FCHKSL_CHECKSUM1            _FCHKS.Overlap_STR.FCHKSLSTR.Bits.CHECKSUM1
    #define FCHKSL_CHECKSUM2            _FCHKS.Overlap_STR.FCHKSLSTR.Bits.CHECKSUM2
    #define FCHKSL_CHECKSUM3            _FCHKS.Overlap_STR.FCHKSLSTR.Bits.CHECKSUM3
    #define FCHKSL_CHECKSUM4            _FCHKS.Overlap_STR.FCHKSLSTR.Bits.CHECKSUM4
    #define FCHKSL_CHECKSUM5            _FCHKS.Overlap_STR.FCHKSLSTR.Bits.CHECKSUM5
    #define FCHKSL_CHECKSUM6            _FCHKS.Overlap_STR.FCHKSLSTR.Bits.CHECKSUM6
    #define FCHKSL_CHECKSUM7            _FCHKS.Overlap_STR.FCHKSLSTR.Bits.CHECKSUM7
    
    #define FCHKSL_CHECKSUM0_MASK       1U
    #define FCHKSL_CHECKSUM1_MASK       2U
    #define FCHKSL_CHECKSUM2_MASK       4U
    #define FCHKSL_CHECKSUM3_MASK       8U
    #define FCHKSL_CHECKSUM4_MASK       16U
    #define FCHKSL_CHECKSUM5_MASK       32U
    #define FCHKSL_CHECKSUM6_MASK       64U
    #define FCHKSL_CHECKSUM7_MASK       128U
    
  } Overlap_STR;

} FCHKSSTR;
